fields:
  AADTenantId: data/fields/aad_tenant_id.yaml
  ActingAppId: data/fields/acting_app_id.yaml
  ActingAppName: data/fields/acting_app_name.yaml
  ActingAppType: data/fields/acting_app_type.yaml
  ActingOriginalAppType: data/fields/acting_original_app_type.yaml
  ActingProcessCommandLine: data/fields/acting_process_command_line.yaml
  ActingProcessCreationTime: data/fields/acting_process_creation_time.yaml
  ActingProcessFileCompany: data/fields/acting_process_file_company.yaml
  ActingProcessFileDescription: data/fields/acting_process_file_description.yaml
  ActingProcessFileInternalName: data/fields/acting_process_file_internal_name.yaml
  ActingProcessFilename: data/fields/acting_process_filename.yaml
  ActingProcessFileOriginalName: data/fields/acting_process_file_original_name.yaml
  ActingProcessFileProduct: data/fields/acting_process_file_product.yaml
  ActingProcessFileSize: data/fields/acting_process_file_size.yaml
  ActingProcessFileVersion: data/fields/acting_process_file_version.yaml
  ActingProcessGuid: data/fields/acting_process_guid.yaml
  ActingProcessId: data/fields/acting_process_id.yaml
  ActingProcessIMPHASH: data/fields/acting_process_imphash.yaml
  ActingProcessInjectedAddress: data/fields/acting_process_injected_address.yaml
  ActingProcessIntegrityLevel: data/fields/acting_process_integrity_level.yaml
  ActingProcessIsHidden: data/fields/acting_process_is_hidden.yaml
  ActingProcessMD5: data/fields/acting_process_md5.yaml
  ActingProcessName: data/fields/acting_process_name.yaml
  ActingProcessSHA1: data/fields/acting_process_sha1.yaml
  ActingProcessSHA256: data/fields/acting_process_sha256.yaml
  ActingProcessSHA512: data/fields/acting_process_sha512.yaml
  ActingProcessTokenElevation: data/fields/acting_process_token_elevation.yaml
  ActorOriginalUserType: data/fields/actor_original_user_type.yaml
  ActorScope: data/fields/actor_scope.yaml
  ActorScopeId: data/fields/actor_scope_id.yaml
  ActorSessionId: data/fields/actor_session_id.yaml
  ActorUserId: data/fields/actor_user_id.yaml
  ActorUserIdType: data/fields/actor_user_id_type.yaml
  ActorUsername: data/fields/actor_username.yaml
  ActorUsernameType: data/fields/actor_username_type.yaml
  ActorUserScope: data/fields/actor_user_scope.yaml
  ActorUserScopeId: data/fields/actor_user_scope_id.yaml
  ActorUserType: data/fields/actor_user_type.yaml
  AdditionalAssetOwners: data/fields/additional_asset_owners.yaml
  AdditionalFields: data/fields/additional_fields.yaml
  AlertDescription: data/fields/alert_description.yaml
  AlertId: data/fields/alert_id.yaml
  AlertName: data/fields/alert_name.yaml
  AlertOriginalStatus: data/fields/alert_original_status.yaml
  AlertStatus: data/fields/alert_status.yaml
  AlertVerdict: data/fields/alert_verdict.yaml
  Application: data/fields/application.yaml
  ASimMatchingHostname: data/fields/asim_matching_hostname.yaml
  ASimMatchingIpAddr: data/fields/asim_matching_ip_addr.yaml
  AssetClassificationLastScanDateTime: data/fields/asset_classification_last_scan_date_time.yaml
  AssetIsProtectedByDlp: data/fields/asset_is_protected_by_dlp.yaml
  AssetOriginalDataClassificationType: data/fields/asset_original_data_classification_type.yaml
  AssetOriginalPermissions: data/fields/asset_original_permissions.yaml
  AssetOriginalRiskDetails: data/fields/asset_original_risk_details.yaml
  AssetOriginalRiskLevel: data/fields/asset_original_risk_level.yaml
  AssetOriginalSensitivityLevel: data/fields/asset_original_sensitivity_level.yaml
  AssetOriginalType: data/fields/asset_original_type.yaml
  AssetOwnerId: data/fields/asset_owner_id.yaml
  AssetOwnerIdType: data/fields/asset_owner_id_type.yaml
  AssetOwnerScope: data/fields/asset_owner_scope.yaml
  AssetOwnerScopeId: data/fields/asset_owner_scope_id.yaml
  AssetOwnerType: data/fields/asset_owner_type.yaml
  AssetPath: data/fields/asset_path.yaml
  AssetRelatedIndicators: data/fields/asset_related_indicators.yaml
  AssetRiskFirstReportedTime: data/fields/asset_risk_first_reported_time.yaml
  AssetRiskLastReportedTime: data/fields/asset_risk_last_reported_time.yaml
  AssetRiskLevel: data/fields/asset_risk_level.yaml
  AssetRiskName: data/fields/asset_risk_name.yaml
  AssetSensitivityLabel: data/fields/asset_sensitivity_label.yaml
  AssetType: data/fields/asset_type.yaml
  AttackRemediationSteps: data/fields/attack_remediation_steps.yaml
  AttackTactics: data/fields/attack_tactics.yaml
  AttackTechniques: data/fields/attack_techniques.yaml
  CommandLine: data/fields/command_line.yaml
  DetectionMethod: data/fields/detection_method.yaml
  DhcpCircuitId: data/fields/dhcp_circuit_id.yaml
  DhcpLeaseDuration: data/fields/dhcp_lease_duration.yaml
  DhcpSessionDuration: data/fields/dhcp_session_duration.yaml
  DhcpSessionId: data/fields/dhcp_session_id.yaml
  DhcpSrcDHCId: data/fields/dhcp_src_dhc_id.yaml
  DhcpSubscriberId: data/fields/dhcp_subscriber_id.yaml
  DhcpUserClass: data/fields/dhcp_user_class.yaml
  DhcpUserClassId: data/fields/dhcp_user_class_id.yaml
  DhcpVendorClass: data/fields/dhcp_vendor_class.yaml
  DhcpVendorClassId: data/fields/dhcp_vendor_class_id.yaml
  DnsFlags: data/fields/dns_flags.yaml
  DnsFlagsAuthenticated: data/fields/dns_flags_authenticated.yaml
  DnsFlagsAuthoritative: data/fields/dns_flags_authoritative.yaml
  DnsFlagsCheckingDisabled: data/fields/dns_flags_checking_disabled.yaml
  DnsFlagsRecursionAvailable: data/fields/dns_flags_recursion_available.yaml
  DnsFlagsRecursionDesired: data/fields/dns_flags_recursion_desired.yaml
  DnsFlagsTruncated: data/fields/dns_flags_truncated.yaml
  DnsFlagsZ: data/fields/dns_flags_z.yaml
  DnsNetworkDuration: data/fields/dns_network_duration.yaml
  DnsQuery: data/fields/dns_query.yaml
  DnsQueryClass: data/fields/dns_query_class.yaml
  DnsQueryClassName: data/fields/dns_query_class_name.yaml
  DnsQueryType: data/fields/dns_query_type.yaml
  DnsQueryTypeName: data/fields/dns_query_type_name.yaml
  DnsResponseCode: data/fields/dns_response_code.yaml
  DnsResponseCodeName: data/fields/dns_response_code_name.yaml
  DnsResponseIpCity: data/fields/dns_response_ip_city.yaml
  DnsResponseIpCountry: data/fields/dns_response_ip_country.yaml
  DnsResponseIpLatitude: data/fields/dns_response_ip_latitude.yaml
  DnsResponseIpLongitude: data/fields/dns_response_ip_longitude.yaml
  DnsResponseIpRegion: data/fields/dns_response_ip_region.yaml
  DnsResponseName: data/fields/dns_response_name.yaml
  DnsSessionId: data/fields/dns_session_id.yaml
  Domain: data/fields/domain.yaml
  DomainCategory: data/fields/domain_category.yaml
  Dst: data/fields/dst.yaml
  DstAppId: data/fields/dst_app_id.yaml
  DstAppName: data/fields/dst_app_name.yaml
  DstAppType: data/fields/dst_app_type.yaml
  DstBytes: data/fields/dst_bytes.yaml
  DstDescription: data/fields/dst_description.yaml
  DstDeviceType: data/fields/dst_device_type.yaml
  DstDomain: data/fields/dst_domain.yaml
  DstDomainType: data/fields/dst_domain_type.yaml
  DstDvcId: data/fields/dst_dvc_id.yaml
  DstDvcIdType: data/fields/dst_dvc_id_type.yaml
  DstDvcScope: data/fields/dst_dvc_scope.yaml
  DstDvcScopeId: data/fields/dst_dvc_scope_id.yaml
  DstFQDN: data/fields/dst_fqdn.yaml
  DstGeoCity: data/fields/dst_geo_city.yaml
  DstGeoCountry: data/fields/dst_geo_country.yaml
  DstGeoLatitude: data/fields/dst_geo_latitude.yaml
  DstGeoLongitude: data/fields/dst_geo_longitude.yaml
  DstGeoRegion: data/fields/dst_geo_region.yaml
  DstHostname: data/fields/dst_hostname.yaml
  DstInterfaceGuid: data/fields/dst_interface_guid.yaml
  DstInterfaceName: data/fields/dst_interface_name.yaml
  DstIpAddr: data/fields/dst_ip_addr.yaml
  DstMacAddr: data/fields/dst_mac_addr.yaml
  DstNatIpAddr: data/fields/dst_nat_ip_addr.yaml
  DstNatPortNumber: data/fields/dst_nat_port_number.yaml
  DstOriginalRiskLevel: data/fields/dst_original_risk_level.yaml
  DstOriginalUserType: data/fields/dst_original_user_type.yaml
  DstPackets: data/fields/dst_packets.yaml
  DstPortNumber: data/fields/dst_port_number.yaml
  DstProcessGuid: data/fields/dst_process_guid.yaml
  DstProcessId: data/fields/dst_process_id.yaml
  DstProcessName: data/fields/dst_process_name.yaml
  DstRiskLevel: data/fields/dst_risk_level.yaml
  DstUserId: data/fields/dst_user_id.yaml
  DstUserIdType: data/fields/dst_user_id_type.yaml
  DstUsername: data/fields/dst_username.yaml
  DstUsernameType: data/fields/dst_username_type.yaml
  DstUserScope: data/fields/dst_user_scope.yaml
  DstUserScopeId: data/fields/dst_user_scope_id.yaml
  DstUserType: data/fields/dst_user_type.yaml
  DstVlanId: data/fields/dst_vlan_id.yaml
  DstZone: data/fields/dst_zone.yaml
  Duration: data/fields/duration.yaml
  Dvc: data/fields/dvc.yaml
  DvcAction: data/fields/dvc_action.yaml
  DvcDescription: data/fields/dvc_description.yaml
  DvcDomain: data/fields/dvc_domain.yaml
  DvcDomainType: data/fields/dvc_domain_type.yaml
  DvcFQDN: data/fields/dvc_fqdn.yaml
  DvcHostname: data/fields/dvc_hostname.yaml
  DvcId: data/fields/dvc_id.yaml
  DvcIdType: data/fields/dvc_id_type.yaml
  DvcInboundInterface: data/fields/dvc_inbound_interface.yaml
  DvcInterface: data/fields/dvc_interface.yaml
  DvcIpAddr: data/fields/dvc_ip_addr.yaml
  DvcMacAddr: data/fields/dvc_mac_addr.yaml
  DvcOriginalAction: data/fields/dvc_original_action.yaml
  DvcOs: data/fields/dvc_os.yaml
  DvcOsVersion: data/fields/dvc_os_version.yaml
  DvcOutboundInterface: data/fields/dvc_outbound_interface.yaml
  DvcScope: data/fields/dvc_scope.yaml
  DvcScopeId: data/fields/dvc_scope_id.yaml
  DvcZone: data/fields/dvc_zone.yaml
  EmailMessageId: data/fields/email_message_id.yaml
  EmailSubject: data/fields/email_subject.yaml
  EntityCreatedTime: data/fields/entity_created_time.yaml
  EntityFeedType: data/fields/entity_feed_type.yaml
  EntityId: data/fields/entity_id.yaml
  EntityIngestionTime: data/fields/entity_ingestion_time.yaml
  EntityIsDeleted: data/fields/entity_is_deleted.yaml
  EntityLastAccessedTime: data/fields/entity_last_accessed_time.yaml
  EntityLastModifiedTime: data/fields/entity_last_modified_time.yaml
  EntityName: data/fields/entity_name.yaml
  EntityNameType: data/fields/entity_name_type.yaml
  EntityOriginalId: data/fields/entity_original_id.yaml
  EntityOriginalSource: data/fields/entity_original_source.yaml
  EntityProduct: data/fields/entity_product.yaml
  EntitySchema: data/fields/entity_schema.yaml
  EntitySchemaVersion: data/fields/entity_schema_version.yaml
  EntitySource: data/fields/entity_source.yaml
  EntitySubProduct: data/fields/entity_sub_product.yaml
  EntityUpdatedTime: data/fields/entity_updated_time.yaml
  EntityVendor: data/fields/entity_vendor.yaml
  EventCount: data/fields/event_count.yaml
  EventEndTime: data/fields/event_end_time.yaml
  EventErrorDetails: data/fields/event_error_details.yaml
  EventFinishReasons: data/fields/event_finish_reasons.yaml
  EventMessage: data/fields/event_message.yaml
  EventOriginalErrorType: data/fields/event_original_error_type.yaml
  EventOriginalRequestDetails: data/fields/event_original_request_details.yaml
  EventOriginalResultDetails: data/fields/event_original_result_details.yaml
  EventOriginalSeverity: data/fields/event_original_severity.yaml
  EventOriginalSubType: data/fields/event_original_sub_type.yaml
  EventOriginalType: data/fields/event_original_type.yaml
  EventOriginalUid: data/fields/event_original_uid.yaml
  EventOutputType: data/fields/event_output_type.yaml
  EventOwner: data/fields/event_owner.yaml
  EventProduct: data/fields/event_product.yaml
  EventProductVersion: data/fields/event_product_version.yaml
  EventReportUrl: data/fields/event_report_url.yaml
  EventRequestFrequencyPenalty: data/fields/event_request_frequency_penalty.yaml
  EventRequestId: data/fields/event_request_id.yaml
  EventRequestPresencePenalty: data/fields/event_request_presence_penalty.yaml
  EventRequestSeed: data/fields/event_request_seed.yaml
  EventRequestTemperature: data/fields/event_request_temperature.yaml
  EventRequestTopP: data/fields/event_request_top_p.yaml
  EventResponseId: data/fields/event_response_id.yaml
  EventResult: data/fields/event_result.yaml
  EventResultDetails: data/fields/event_result_details.yaml
  EventSchema: data/fields/event_schema.yaml
  EventSchemaVersion: data/fields/event_schema_version.yaml
  EventSessionId: data/fields/event_session_id.yaml
  EventSessionName: data/fields/event_session_name.yaml
  EventSeverity: data/fields/event_severity.yaml
  EventStartTime: data/fields/event_start_time.yaml
  EventSubType: data/fields/event_sub_type.yaml
  EventThoughtProcessDetails: data/fields/event_thought_process_details.yaml
  EventThoughtProcessId: data/fields/event_thought_process_id.yaml
  EventType: data/fields/event_type.yaml
  EventUid: data/fields/event_uid.yaml
  EventVendor: data/fields/event_vendor.yaml
  ExternalUsersCount: data/fields/external_users_count.yaml
  FileContentType: data/fields/file_content_type.yaml
  FileExtension: data/fields/file_extension.yaml
  FileIsSignatureValid: data/fields/file_is_signature_valid.yaml
  FileMD5: data/fields/file_md5.yaml
  FileName: data/fields/file_name.yaml
  FilePath: data/fields/file_path.yaml
  FileSHA1: data/fields/file_sha1.yaml
  FileSHA256: data/fields/file_sha256.yaml
  FileSHA512: data/fields/file_sha512.yaml
  FileSignatureDetails: data/fields/file_signature_details.yaml
  FileSize: data/fields/file_size.yaml
  GroupId: data/fields/group_id.yaml
  GroupIdType: data/fields/group_id_type.yaml
  GroupName: data/fields/group_name.yaml
  GroupNameType: data/fields/group_name_type.yaml
  GroupOriginalType: data/fields/group_original_type.yaml
  GroupType: data/fields/group_type.yaml
  Hash: data/fields/hash.yaml
  HashType: data/fields/hash_type.yaml
  Hostname: data/fields/hostname.yaml
  HttpContentFormat: data/fields/http_content_format.yaml
  HttpContentType: data/fields/http_content_type.yaml
  HttpCookie: data/fields/http_cookie.yaml
  HttpHost: data/fields/http_host.yaml
  HttpIsProxied: data/fields/http_is_proxied.yaml
  HttpReferrer: data/fields/http_referrer.yaml
  HttpRequestBodyBytes: data/fields/http_request_body_bytes.yaml
  HttpRequestCacheControl: data/fields/http_request_cache_control.yaml
  HttpRequestHeaderCount: data/fields/http_request_header_count.yaml
  HttpRequestMethod: data/fields/http_request_method.yaml
  HttpRequestTime: data/fields/http_request_time.yaml
  HttpRequestXff: data/fields/http_request_xff.yaml
  HttpResponseBodyBytes: data/fields/http_response_body_bytes.yaml
  HttpResponseCacheControl: data/fields/http_response_cache_control.yaml
  HttpResponseExpires: data/fields/http_response_expires.yaml
  HttpResponseHeaderCount: data/fields/http_response_header_count.yaml
  HttpResponseTime: data/fields/http_response_time.yaml
  HttpStatusCode: data/fields/http_status_code.yaml
  HttpUserAgent: data/fields/http_user_agent.yaml
  HttpVersion: data/fields/http_version.yaml
  IdentityDirectoryId: data/fields/identity_directory_id.yaml
  IdentityDirectoryName: data/fields/identity_directory_name.yaml
  IndicatorAssociation: data/fields/indicator_association.yaml
  IndicatorType: data/fields/indicator_type.yaml
  InnerVlanId: data/fields/inner_vlan_id.yaml
  InputTokensUsed: data/fields/input_tokens_used.yaml
  InternalUsersCount: data/fields/internal_users_count.yaml
  IpAddr: data/fields/ip_addr.yaml
  LogonMethod: data/fields/logon_method.yaml
  LogonProtocol: data/fields/logon_protocol.yaml
  LogonTarget: data/fields/logon_target.yaml
  ModelName: data/fields/model_name.yaml
  ModelProviderName: data/fields/model_provider_name.yaml
  NetworkApplicationProtocol: data/fields/network_application_protocol.yaml
  NetworkBytes: data/fields/network_bytes.yaml
  NetworkConnectionHistory: data/fields/network_connection_history.yaml
  NetworkDirection: data/fields/network_direction.yaml
  NetworkDuration: data/fields/network_duration.yaml
  NetworkIcmpCode: data/fields/network_icmp_code.yaml
  NetworkIcmpType: data/fields/network_icmp_type.yaml
  NetworkPackets: data/fields/network_packets.yaml
  NetworkProtocol: data/fields/network_protocol.yaml
  NetworkProtocolVersion: data/fields/network_protocol_version.yaml
  NetworkRuleName: data/fields/network_rule_name.yaml
  NetworkRuleNumber: data/fields/network_rule_number.yaml
  NetworkSessionId: data/fields/network_session_id.yaml
  NewPropertyValue: data/fields/new_property_value.yaml
  NewValue: data/fields/new_value.yaml
  Object: data/fields/object.yaml
  ObjectId: data/fields/object_id.yaml
  ObjectType: data/fields/object_type.yaml
  OldValue: data/fields/old_value.yaml
  Operation: data/fields/operation.yaml
  OriginalObjectType: data/fields/original_object_type.yaml
  OriginalUserType: data/fields/original_user_type.yaml
  OuterVlanId: data/fields/outer_vlan_id.yaml
  OutputTokensUsed: data/fields/output_tokens_used.yaml
  ParentProcessCreationTime: data/fields/parent_process_creation_time.yaml
  ParentProcessFileCompany: data/fields/parent_process_file_company.yaml
  ParentProcessFileDescription: data/fields/parent_process_file_description.yaml
  ParentProcessFileProduct: data/fields/parent_process_file_product.yaml
  ParentProcessFileVersion: data/fields/parent_process_file_version.yaml
  ParentProcessGuid: data/fields/parent_process_guid.yaml
  ParentProcessId: data/fields/parent_process_id.yaml
  ParentProcessIMPHASH: data/fields/parent_process_imphash.yaml
  ParentProcessInjectedAddress: data/fields/parent_process_injected_address.yaml
  ParentProcessIntegrityLevel: data/fields/parent_process_integrity_level.yaml
  ParentProcessIsHidden: data/fields/parent_process_is_hidden.yaml
  ParentProcessMD5: data/fields/parent_process_md5.yaml
  ParentProcessName: data/fields/parent_process_name.yaml
  ParentProcessSHA1: data/fields/parent_process_sha1.yaml
  ParentProcessSHA256: data/fields/parent_process_sha256.yaml
  ParentProcessSHA512: data/fields/parent_process_sha512.yaml
  ParentProcessTokenElevation: data/fields/parent_process_token_elevation.yaml
  PlatformTargetAgentDescription: data/fields/platform_target_agent_description.yaml
  PlatformTargetAgentId: data/fields/platform_target_agent_id.yaml
  PlatformTargetAgentName: data/fields/platform_target_agent_name.yaml
  PlatformTargetOriginalAgentType: data/fields/platform_target_original_agent_type.yaml
  PreviousPropertyValue: data/fields/previous_property_value.yaml
  Process: data/fields/process.yaml
  ProcessCommandLine: data/fields/process_command_line.yaml
  ProcessFileCompany: data/fields/process_file_company.yaml
  ProcessId: data/fields/process_id.yaml
  ProcessName: data/fields/process_name.yaml
  RegistryKey: data/fields/registry_key.yaml
  RegistryPreviousKey: data/fields/registry_previous_key.yaml
  RegistryPreviousValue: data/fields/registry_previous_value.yaml
  RegistryPreviousValueData: data/fields/registry_previous_value_data.yaml
  RegistryPreviousValueType: data/fields/registry_previous_value_type.yaml
  RegistryValue: data/fields/registry_value.yaml
  RegistryValueData: data/fields/registry_value_data.yaml
  RegistryValueType: data/fields/registry_value_type.yaml
  RequestedIpAddr: data/fields/requested_ip_addr.yaml
  Rule: data/fields/rule.yaml
  RuleDescription: data/fields/rule_description.yaml
  RuleName: data/fields/rule_name.yaml
  RuleNumber: data/fields/rule_number.yaml
  SessionId: data/fields/session_id.yaml
  SitePath: data/fields/site_path.yaml
  SitePrimaryUri: data/fields/site_primary_uri.yaml
  Src: data/fields/src.yaml
  SrcAgentBlueprintId: data/fields/src_agent_blueprint_id.yaml
  SrcAgentDescription: data/fields/src_agent_description.yaml
  SrcAgentId: data/fields/src_agent_id.yaml
  SrcAgentName: data/fields/src_agent_name.yaml
  SrcAgentOriginalType: data/fields/src_agent_original_type.yaml
  SrcAppId: data/fields/src_app_id.yaml
  SrcAppName: data/fields/src_app_name.yaml
  SrcAppType: data/fields/src_app_type.yaml
  SrcBytes: data/fields/src_bytes.yaml
  SrcDescription: data/fields/src_description.yaml
  SrcDeviceType: data/fields/src_device_type.yaml
  SrcDomain: data/fields/src_domain.yaml
  SrcDomainType: data/fields/src_domain_type.yaml
  SrcDvcId: data/fields/src_dvc_id.yaml
  SrcDvcIdType: data/fields/src_dvc_id_type.yaml
  SrcDvcOs: data/fields/src_dvc_os.yaml
  SrcDvcScope: data/fields/src_dvc_scope.yaml
  SrcDvcScopeId: data/fields/src_dvc_scope_id.yaml
  SrcFileCreationTime: data/fields/src_file_creation_time.yaml
  SrcFileDirectory: data/fields/src_file_directory.yaml
  SrcFileExtension: data/fields/src_file_extension.yaml
  SrcFileMD5: data/fields/src_file_md5.yaml
  SrcFileMimeType: data/fields/src_file_mime_type.yaml
  SrcFileName: data/fields/src_file_name.yaml
  SrcFilePath: data/fields/src_file_path.yaml
  SrcFilePathType: data/fields/src_file_path_type.yaml
  SrcFileSHA1: data/fields/src_file_sha1.yaml
  SrcFileSHA256: data/fields/src_file_sha256.yaml
  SrcFileSHA512: data/fields/src_file_sha512.yaml
  SrcFileSize: data/fields/src_file_size.yaml
  SrcFQDN: data/fields/src_fqdn.yaml
  SrcGeoCity: data/fields/src_geo_city.yaml
  SrcGeoCountry: data/fields/src_geo_country.yaml
  SrcGeoLatitude: data/fields/src_geo_latitude.yaml
  SrcGeoLongitude: data/fields/src_geo_longitude.yaml
  SrcGeoRegion: data/fields/src_geo_region.yaml
  SrcHostname: data/fields/src_hostname.yaml
  SrcInterfaceGuid: data/fields/src_interface_guid.yaml
  SrcInterfaceName: data/fields/src_interface_name.yaml
  SrcIpAddr: data/fields/src_ip_addr.yaml
  SrcIsp: data/fields/src_isp.yaml
  SrcMacAddr: data/fields/src_mac_addr.yaml
  SrcNatIpAddr: data/fields/src_nat_ip_addr.yaml
  SrcNatPortNumber: data/fields/src_nat_port_number.yaml
  SrcOriginalRiskLevel: data/fields/src_original_risk_level.yaml
  SrcOriginalUserType: data/fields/src_original_user_type.yaml
  SrcPackets: data/fields/src_packets.yaml
  SrcPortNumber: data/fields/src_port_number.yaml
  SrcProcessGuid: data/fields/src_process_guid.yaml
  SrcProcessId: data/fields/src_process_id.yaml
  SrcProcessName: data/fields/src_process_name.yaml
  SrcRiskLevel: data/fields/src_risk_level.yaml
  SrcUserId: data/fields/src_user_id.yaml
  SrcUserIdType: data/fields/src_user_id_type.yaml
  SrcUsername: data/fields/src_username.yaml
  SrcUsernameType: data/fields/src_username_type.yaml
  SrcUserScope: data/fields/src_user_scope.yaml
  SrcUserScopeId: data/fields/src_user_scope_id.yaml
  SrcUserSessionId: data/fields/src_user_session_id.yaml
  SrcUserType: data/fields/src_user_type.yaml
  SrcVlanId: data/fields/src_vlan_id.yaml
  SrcZone: data/fields/src_zone.yaml
  TargetAgentBlueprintId: data/fields/target_agent_blueprint_id.yaml
  TargetAgentDescription: data/fields/target_agent_description.yaml
  TargetAgentId: data/fields/target_agent_id.yaml
  TargetAgentName: data/fields/target_agent_name.yaml
  TargetAgentOriginalType: data/fields/target_agent_original_type.yaml
  TargetAgentUserId: data/fields/target_agent_user_id.yaml
  TargetAgentUsername: data/fields/target_agent_username.yaml
  TargetAppId: data/fields/target_app_id.yaml
  TargetAppName: data/fields/target_app_name.yaml
  TargetAppType: data/fields/target_app_type.yaml
  TargetDescription: data/fields/target_description.yaml
  TargetDeviceType: data/fields/target_device_type.yaml
  TargetDomain: data/fields/target_domain.yaml
  TargetDomainType: data/fields/target_domain_type.yaml
  TargetDvcId: data/fields/target_dvc_id.yaml
  TargetDvcIdType: data/fields/target_dvc_id_type.yaml
  TargetDvcOs: data/fields/target_dvc_os.yaml
  TargetDvcScope: data/fields/target_dvc_scope.yaml
  TargetDvcScopeId: data/fields/target_dvc_scope_id.yaml
  TargetFileCreationTime: data/fields/target_file_creation_time.yaml
  TargetFileDirectory: data/fields/target_file_directory.yaml
  TargetFileExtension: data/fields/target_file_extension.yaml
  TargetFileMD5: data/fields/target_file_md5.yaml
  TargetFileMimeType: data/fields/target_file_mime_type.yaml
  TargetFileName: data/fields/target_file_name.yaml
  TargetFilePath: data/fields/target_file_path.yaml
  TargetFilePathType: data/fields/target_file_path_type.yaml
  TargetFileSHA1: data/fields/target_file_sha1.yaml
  TargetFileSHA256: data/fields/target_file_sha256.yaml
  TargetFileSHA512: data/fields/target_file_sha512.yaml
  TargetFileSize: data/fields/target_file_size.yaml
  TargetFQDN: data/fields/target_fqdn.yaml
  TargetGeoCity: data/fields/target_geo_city.yaml
  TargetGeoCountry: data/fields/target_geo_country.yaml
  TargetGeoLatitude: data/fields/target_geo_latitude.yaml
  TargetGeoLongitude: data/fields/target_geo_longitude.yaml
  TargetGeoRegion: data/fields/target_geo_region.yaml
  TargetHostname: data/fields/target_hostname.yaml
  TargetIpAddr: data/fields/target_ip_addr.yaml
  TargetOriginalAppType: data/fields/target_original_app_type.yaml
  TargetOriginalRiskLevel: data/fields/target_original_risk_level.yaml
  TargetOriginalUserType: data/fields/target_original_user_type.yaml
  TargetPortNumber: data/fields/target_port_number.yaml
  TargetProcessCommandLine: data/fields/target_process_command_line.yaml
  TargetProcessCreationTime: data/fields/target_process_creation_time.yaml
  TargetProcessCurrentDirectory: data/fields/target_process_current_directory.yaml
  TargetProcessFileCompany: data/fields/target_process_file_company.yaml
  TargetProcessFileDescription: data/fields/target_process_file_description.yaml
  TargetProcessFileInternalName: data/fields/target_process_file_internal_name.yaml
  TargetProcessFilename: data/fields/target_process_filename.yaml
  TargetProcessFileOriginalName: data/fields/target_process_file_original_name.yaml
  TargetProcessFileProduct: data/fields/target_process_file_product.yaml
  TargetProcessFileSize: data/fields/target_process_file_size.yaml
  TargetProcessFileVersion: data/fields/target_process_file_version.yaml
  TargetProcessGuid: data/fields/target_process_guid.yaml
  TargetProcessId: data/fields/target_process_id.yaml
  TargetProcessIMPHASH: data/fields/target_process_imphash.yaml
  TargetProcessInjectedAddress: data/fields/target_process_injected_address.yaml
  TargetProcessIntegrityLevel: data/fields/target_process_integrity_level.yaml
  TargetProcessIsHidden: data/fields/target_process_is_hidden.yaml
  TargetProcessMD5: data/fields/target_process_md5.yaml
  TargetProcessName: data/fields/target_process_name.yaml
  TargetProcessSHA1: data/fields/target_process_sha1.yaml
  TargetProcessSHA256: data/fields/target_process_sha256.yaml
  TargetProcessSHA512: data/fields/target_process_sha512.yaml
  TargetProcessStatusCode: data/fields/target_process_status_code.yaml
  TargetProcessTokenElevation: data/fields/target_process_token_elevation.yaml
  TargetRiskLevel: data/fields/target_risk_level.yaml
  TargetSessionId: data/fields/target_session_id.yaml
  TargetUrl: data/fields/target_url.yaml
  TargetUserId: data/fields/target_user_id.yaml
  TargetUserIdType: data/fields/target_user_id_type.yaml
  TargetUsername: data/fields/target_username.yaml
  TargetUsernameType: data/fields/target_username_type.yaml
  TargetUserScope: data/fields/target_user_scope.yaml
  TargetUserScopeId: data/fields/target_user_scope_id.yaml
  TargetUserSessionGuid: data/fields/target_user_session_guid.yaml
  TargetUserSessionId: data/fields/target_user_session_id.yaml
  TargetUserType: data/fields/target_user_type.yaml
  TcpFlagsAck: data/fields/tcp_flags_ack.yaml
  TcpFlagsCwr: data/fields/tcp_flags_cwr.yaml
  TcpFlagsEce: data/fields/tcp_flags_ece.yaml
  TcpFlagsFin: data/fields/tcp_flags_fin.yaml
  TcpFlagsNs: data/fields/tcp_flags_ns.yaml
  TcpFlagsPsh: data/fields/tcp_flags_psh.yaml
  TcpFlagsRst: data/fields/tcp_flags_rst.yaml
  TcpFlagsSyn: data/fields/tcp_flags_syn.yaml
  TcpFlagsUrg: data/fields/tcp_flags_urg.yaml
  ThreatCategory: data/fields/threat_category.yaml
  ThreatConfidence: data/fields/threat_confidence.yaml
  ThreatField: data/fields/threat_field.yaml
  ThreatFilePath: data/fields/threat_file_path.yaml
  ThreatFirstReportedTime: data/fields/threat_first_reported_time.yaml
  ThreatId: data/fields/threat_id.yaml
  ThreatIpAddr: data/fields/threat_ip_addr.yaml
  ThreatIsActive: data/fields/threat_is_active.yaml
  ThreatLastReportedTime: data/fields/threat_last_reported_time.yaml
  ThreatName: data/fields/threat_name.yaml
  ThreatOriginalCategory: data/fields/threat_original_category.yaml
  ThreatOriginalConfidence: data/fields/threat_original_confidence.yaml
  ThreatOriginalRiskLevel: data/fields/threat_original_risk_level.yaml
  ThreatRiskLevel: data/fields/threat_risk_level.yaml
  ToolDescription: data/fields/tool_description.yaml
  ToolId: data/fields/tool_id.yaml
  ToolName: data/fields/tool_name.yaml
  ToolOriginalType: data/fields/tool_original_type.yaml
  TransactionIdHex: data/fields/transaction_id_hex.yaml
  UpdatedPropertyName: data/fields/updated_property_name.yaml
  Url: data/fields/url.yaml
  UrlCategory: data/fields/url_category.yaml
  UrlOriginal: data/fields/url_original.yaml
  User: data/fields/user.yaml
  UserAgent: data/fields/user_agent.yaml
  UserId: data/fields/user_id.yaml
  UserIdType: data/fields/user_id_type.yaml
  Username: data/fields/username.yaml
  UsernameType: data/fields/username_type.yaml
  UserScope: data/fields/user_scope.yaml
  UserScopeId: data/fields/user_scope_id.yaml
  UserSessionId: data/fields/user_session_id.yaml
  UserType: data/fields/user_type.yaml
  Value: data/fields/value.yaml
  ValueType: data/fields/value_type.yaml
