name: DLP
display_name: Data Loss Prevention
description: Data Loss Prevention Data Model
root_datasets:
- DLP_Incidents
datasets:
  DLP_Incidents:
    display_name: DLP Incidents
    kind: event
    tags:
    - dlp
    - incident
    constraints:
    - (`cim_DLP_indexes`) tag=dlp tag=incident
    fields:
      _time:
        source: base
      action:
        source: calculated
        type: string
        description: The action taken by the DLP device.
        recommended: true
        calculation:
          id: DLP_Incidents_fillnull_action
          type: Eval
          expression: if(isnull(action) OR action="","unknown",action)
      app:
        source: declared
        type: string
        description: The application involved in the event.
      category:
        source: calculated
        type: string
        description: The category of the DLP event.
        recommended: true
        calculation:
          id: DLP_Incidents_fillnull_category
          type: Eval
          expression: if(isnull(object_category) OR object_category="","unknown",object_category)
      cim_entity_zone:
        source: declared
        type: string
        description: This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
      dest:
        source: calculated
        type: string
        description: The target of the DLP event.
        recommended: true
        calculation:
          id: DLP_Incidents_fillnull_dest
          type: Eval
          expression: if(isnull(dest) OR dest="","unknown",dest)
      dest_bunit:
        source: declared
        type: string
        description: The business unit of the DLP target. This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
      dest_category:
        source: declared
        type: string
        description: The category of the DLP target. This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
        multivalue: true
      dest_priority:
        source: declared
        type: string
        description: The priority of the DLP target. This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
      dest_zone:
        source: declared
        type: string
        description: The zone of the DLP target.
      dlp_type:
        source: calculated
        type: string
        description: The type of DLP system that generated the event.
        recommended: true
        calculation:
          id: DLP_incidents_fillnull_dlp_type
          type: Eval
          expression: if(isnull(dlp_type) OR dlp_type="","unknown",dlp_type)
      dvc:
        source: calculated
        type: string
        description: The device that reported the DLP event.
        recommended: true
        calculation:
          id: DLP_Incidents_fillnull_dvc
          type: Eval
          expression: if(isnull(dvc) OR dvc="","unknown",dvc)
      dvc_bunit:
        source: declared
        type: string
        description: The business unit of the DLP device. This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
      dvc_category:
        source: declared
        type: string
        description: The category of the DLP device. This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
        multivalue: true
      dvc_priority:
        source: declared
        type: string
        description: The priority of the DLP device. This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
      dvc_zone:
        source: declared
        type: string
        description: The zone of the DLP device.
      host:
        source: base
      object:
        source: calculated
        type: string
        description: The name of the affected object.
        recommended: true
        calculation:
          id: DLP_Incidents_fillnull_object
          type: Eval
          expression: if(isnull(object) OR object="","unknown",object)
      object_category:
        source: calculated
        type: string
        description: The category of the affected object.
        recommended: true
        calculation:
          id: DLP_Incidents_fillnull_object_category
          type: Eval
          expression: if(isnull(object_category) OR object_category="","unknown",object_category)
      object_path:
        source: calculated
        type: string
        description: The path of the affected object.
        recommended: true
        calculation:
          id: DLP_Incidents_fillnull_object_path
          type: Eval
          expression: if(isnull(object_path) OR object_path="","unknown",object_path)
      severity:
        source: calculated
        type: string
        description: The severity of the DLP event.
        recommended: true
        calculation:
          id: DLP_Incidents_fillnull_severity
          type: Eval
          expression: if(isnull(severity) OR severity="","unknown",severity)
      severity_id:
        source: declared
        type: string
        description: The numeric or vendor specific severity indicator corresponding to the event severity.
      signature:
        source: calculated
        type: string
        description: The name of the DLP event.
        recommended: true
        calculation:
          id: DLP_Incidents_fillnull_signature
          type: Eval
          expression: if(isnull(signature) OR signature="","unknown",signature)
      signature_id:
        source: declared
        type: string
        description: The unique identifier or event code of the event signature.
      source:
        source: base
      sourcetype:
        source: base
      src:
        source: calculated
        type: string
        description: The source of the DLP event.
        recommended: true
        calculation:
          id: DLP_Incidents_fillnull_src
          type: Eval
          expression: if(isnull(src) OR src="","unknown",src)
      src_bunit:
        source: declared
        type: string
        description: The business unit of the DLP source. This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
      src_category:
        source: declared
        type: string
        description: The category of the DLP source. This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
        multivalue: true
      src_priority:
        source: declared
        type: string
        description: The priority of the DLP source. This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
      src_user:
        source: calculated
        type: string
        description: The source user of the DLP event.
        recommended: true
        calculation:
          id: DLP_Incidents_fillnull_src_user
          type: Eval
          expression: if(isnull(src_user) OR user="","unknown",src_user)
      src_user_bunit:
        source: declared
        type: string
        description: The business unit of the DLP source user. This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
      src_user_category:
        source: declared
        type: string
        description: The category of the DLP source user. This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
        multivalue: true
      src_user_priority:
        source: declared
        type: string
        description: The priority of the DLP source user. This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
      src_zone:
        source: declared
        type: string
        description: The zone of the DLP source.
      tag:
        source: declared
        type: string
        description: This automatically generated field is used to access tags from within data models. Add-on builders do not need to populate it.
        multivalue: true
      user:
        source: calculated
        type: string
        description: The target user of the DLP event.
        recommended: true
        calculation:
          id: DLP_Incidents_fillnull_user
          type: Eval
          expression: if(isnull(user) OR user="","unknown",user)
      user_bunit:
        source: declared
        type: string
        description: The business unit of the DLP user. This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
      user_category:
        source: declared
        type: string
        description: The category of the DLP user. This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
        multivalue: true
      user_priority:
        source: declared
        type: string
        description: The priority of the DLP user. This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
      vendor_product:
        source: calculated
        type: string
        description: The vendor and product name of the DLP system.
        recommended: true
        calculation:
          id: DLP_Incidents_vendor_product
          type: Eval
          expression: case(isnotnull(vendor_product),vendor_product,isnotnull(vendor) AND vendor!="unknown" AND isnotnull(product) AND product!="unknown",vendor." ".product,isnotnull(vendor) AND vendor!="unknown" AND (isnull(product) OR product="unknown"),vendor." unknown",(isnull(vendor) OR vendor="unknown") AND isnotnull(product) AND product!="unknown","unknown ".product,isnotnull(sourcetype),sourcetype,1=1,"unknown")
    inherits:
    - BaseEvent
