name: dest_bunit
used_by:
- model: Alerts
  dataset: Alerts
  kind: event
  source: declared
  type: string
  description: The business unit associated with the destination. This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
- model: Application_State
  dataset: All_Application_State
  kind: event
  source: declared
  type: string
  description: This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
- model: Authentication
  dataset: Authentication
  kind: event
  source: declared
  type: string
  description: The business unit of the authentication target. This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
- model: Certificates
  dataset: All_Certificates
  kind: event
  source: declared
  type: string
  description: The business unit of the target. This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
- model: Change
  dataset: All_Changes
  kind: event
  source: declared
  type: string
  description: This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
- model: Change_Analysis
  dataset: All_Changes
  kind: event
  source: declared
  type: string
  description: This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
- model: Compute_Inventory
  dataset: All_Inventory
  kind: event
  source: declared
  type: string
  description: The business unit of the system where the data originated. This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
- model: Data_Access
  dataset: Data_Access
  kind: event
  source: declared
  type: string
  description: This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
- model: Databases
  dataset: All_Databases
  kind: event
  source: declared
  type: string
  description: The business unit of the destination.
- model: DLP
  dataset: DLP_Incidents
  kind: event
  source: declared
  type: string
  description: The business unit of the DLP target. This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
- model: Email
  dataset: All_Email
  kind: event
  source: declared
  type: string
  description: The business unit of the endpoint system to which the message was delivered. This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
- model: Endpoint
  dataset: Filesystem
  kind: search
  source: declared
  type: string
  description: This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
- model: Endpoint
  dataset: Ports
  kind: search
  source: declared
  type: string
  description: This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
- model: Endpoint
  dataset: Processes
  kind: search
  source: declared
  type: string
  description: This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
- model: Endpoint
  dataset: Registry
  kind: search
  source: declared
  type: string
  description: This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
- model: Endpoint
  dataset: Services
  kind: search
  source: declared
  type: string
  description: This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
- model: Event_Signatures
  dataset: Signatures
  kind: event
  source: declared
  type: string
  description: This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
- model: Interprocess_Messaging
  dataset: All_Messaging
  kind: event
  source: declared
  type: string
  description: The business unit of the destination.
- model: Intrusion_Detection
  dataset: IDS_Attacks
  kind: event
  source: declared
  type: string
  description: This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
- model: Malware
  dataset: Malware_Attacks
  kind: event
  source: declared
  type: string
  description: This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
- model: Malware
  dataset: Malware_Operations
  kind: search
  source: declared
  type: string
  description: This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
- model: Network_Resolution
  dataset: DNS
  kind: event
  source: declared
  type: string
  description: The business unit of the destination.
- model: Network_Sessions
  dataset: All_Sessions
  kind: event
  source: declared
  type: string
  description: The business unit of the destination.
- model: Network_Traffic
  dataset: All_Traffic
  kind: event
  source: declared
  type: string
  description: This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
- model: Performance
  dataset: All_Performance
  kind: event
  source: declared
  type: string
  description: The business unit of the system where the event occurred. This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
- model: Ticket_Management
  dataset: All_Ticket_Management
  kind: event
  source: declared
  type: string
  description: The business unit of the destination.
- model: Updates
  dataset: Updates
  kind: event
  source: declared
  type: string
  description: This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
- model: Vulnerabilities
  dataset: Vulnerabilities
  kind: event
  source: declared
  type: string
  description: This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
- model: Web
  dataset: Web
  kind: event
  source: declared
  type: string
  description: This field is automatically provided by asset and identity correlation features of applications like Splunk Enterprise Security. Do not define extractions for this field when writing add-ons.
