name: AlertEvent
title: Alert Event
kind: event
version: '0.1'
status: GA
summary: The Microsoft Sentinel Alert Schema is designed to normalize security-related alerts from various products into a standardized format within Microsoft Advanced Security Information Model (ASIM). This schema focuses exclusively on security events, ensuring consistent and efficient analysis across different data sources. The Alert Schema represents various types of security alerts, such as threats, suspicious activities, user behavior anomalies and compliance violations. These alerts are reported by different security products and systems, including but not limited to EDRs, antivirus software, intrusion detection systems, data loss prevention tools etc. For more information about normalization in Microsoft Sentinel, see Normalization and the Advanced Security Information Model (ASIM).
fields:
- name: EventCount
  role: common
  class: Mandatory
  type: Integer
  description: The number of events described by the record. This value is used when the source supports aggregation, and a single record might represent multiple events. For other sources, set to 1.
- name: EventEndTime
  role: common
  class: Mandatory
  type: Date/time
  to:
  - TimeGenerated
  description: The time when the event ended. If the source supports aggregation and the record represents multiple events, the time that the last event was generated. If not provided by the source record, this field aliases the TimeGenerated field.
- name: EventProduct
  role: common
  class: Mandatory
  type: String
  description: The product generating the event. The value should be one of the values listed in Vendors and Products.
  examples:
  - Sysmon
- name: EventSchema
  role: common
  class: Mandatory
  type: Enumerated
  value: AlertEvent
  description: The schema used for the event. The schema documented here is AlertEvent.
- name: EventSchemaVersion
  role: common
  class: Mandatory
  type: SchemaVersion (String)
  value: '0.1'
  description: The version of the schema. The version of the schema documented here is 0.1.
- name: EventStartTime
  role: common
  class: Mandatory
  type: Date/time
  to:
  - TimeGenerated
  description: The time when the event started. If the source supports aggregation and the record represents multiple events, the time that the first event was generated. If not provided by the source record, this field aliases the TimeGenerated field.
- name: EventType
  role: common
  class: Mandatory
  type: Enumerated
  allowed_values:
  - Alert
  description: 'Type of the event. Supported values are: -Alert'
- name: EventUid
  role: common
  class: Mandatory
  type: string
  description: A machine-readable, alphanumeric string that uniquely identifies an alert within a system. e.g. A1bC2dE3fH4iJ5kL6mN7oP8qR9s
- name: EventVendor
  role: common
  class: Mandatory
  type: String
  description: The vendor of the product generating the event. The value should be one of the values listed in Vendors and Products.
  examples:
  - Microsoft
- name: AlertName
  role: alert
  class: Recommended
  type: string
  description: Title or name of the alert. e.g. Possible use of the Rubeus kerberoasting tool
- name: AttackRemediationSteps
  role: threat
  class: Recommended
  type: string
  description: Recommended actions or steps to mitigate or remediate the identified attack or threat. e.g. 1. Make sure the machine is completely updated and all your software has the latest patch. 2. Contact your incident response team.
- name: AttackTactics
  role: threat
  class: Recommended
  type: string
  description: 'The attack tactics (name, ID, or both) associated with the alert. Preferred format: e.g: Persistence, Privilege Escalation'
- name: AttackTechniques
  role: threat
  class: Recommended
  type: string
  description: 'The attack techniques (name, ID, or both) associated with the alert. Preferred format: e.g: Local Groups (T1069.001), Domain Groups (T1069.002)'
- name: DvcDomain
  role: device
  class: Recommended
  type: Domain (String)
  description: The domain of the device on which the event occurred or which reported the event, depending on the schema.
  examples:
  - Contoso
- name: DvcDomainType
  role: device
  class: Recommended
  type: Enumerated
  required_if:
  - the DvcDomain field is used
  description: The type of DvcDomain. For a list of allowed values and further information, refer to DomainType.
  notes: This field is required if the DvcDomain field is used.
- name: DvcFQDN
  role: device
  class: Recommended
  type: FQDN (String)
  description: The hostname of the device on which the event occurred or which reported the event, depending on the schema.
  examples:
  - Contoso\DESKTOP-1282V4D
  notes: This field supports both traditional FQDN format and Windows domain\hostname format. The DvcDomainType field reflects the format used.
- name: DvcHostname
  role: device
  class: Recommended
  type: Hostname
  description: The hostname of the device on which the event occurred or which reported the event, depending on the schema.
  examples:
  - ContosoDc
- name: DvcId
  role: device
  class: Recommended
  type: String
  description: The unique ID of the device on which the event occurred or which reported the event, depending on the schema. If multiple IDs are available, use the first one from the list, and store the others by using the field names DvcAzureResourceId, DvcMDEid, etc.
  examples:
  - 41502da5-21b7-48ec-81c9-baeea8d7d669
- name: DvcIdType
  role: device
  class: Recommended
  type: Enumerated
  required_if:
  - the DvcId field is used
  allowed_values:
  - AzureResourceId
  - MDEid
  - MD4IoTid
  - VMConnectionId
  - AwsVpcId
  - VectraId
  - AppGateId
  - FQDN
  - Other
  description: The type of DvcId. The list of allowed values is AzureResourceId, MDEid, MD4IoTid, VMConnectionId, AwsVpcId, VectraId, AppGateId, FQDN, and Other. Using FQDN as a device ID, implies reusing the hostname. Use it only as a last resort.
  notes: This field is required if the DvcId field is used.
- name: DvcIpAddr
  role: device
  class: Recommended
  type: IP address
  description: The IP address of the device on which the event occurred or which reported the event, depending on the schema.
  examples:
  - 45.21.42.12
- name: EventSeverity
  role: common
  class: Recommended
  type: Enumerated
  description: 'The severity of the event. Valid values are: Informational, Low, Medium, or High.'
- name: EventSubType
  role: common
  class: Recommended
  type: Enumerated
  allowed_values:
  - Threat (Represents a confirmed or highly likely malicious activity that could compromise the system or network)
  - Suspicious Activity (Flags behavior or events that appear unusual or suspicious, though not yet confirmed as malicious)
  - Anomaly (Identifies deviations from normal patterns that could indicate a potential security risk or operational issue)
  - Compliance Violation (Highlights activities that breach regulatory, policy, or compliance standards)
  description: 'Specifies the subtype or category of the alert event, providing more granular detail within the broader event classification. This field helps distinguish the nature of the detected issue, improving incident prioritization and response strategies. Supported values include: - Threat (Represents a confirmed or highly likely malicious activity that could compromise the system or network) - Suspicious Activity (Flags behavior or events that appear unusual or suspicious, though not yet confirmed as malicious) - Anomaly (Identifies deviations from normal patterns that could indicate a potential security risk or operational issue) - Compliance Violation (Highlights activities that breach regulatory, policy, or compliance standards)'
- name: IndicatorType
  class: Recommended
  type: Enumerated
  allowed_values:
  - Ip
  - User
  - Process
  - Registry
  - Url
  - Host
  - Cloud Resource
  - Application
  - File
  - Email
  - Mailbox
  - Logon Session
  description: 'The type or category of the indicator Supported values are: -Ip -User -Process -Registry -Url -Host -Cloud Resource -Application -File -Email -Mailbox -Logon Session'
- name: ThreatCategory
  role: threat
  class: Recommended
  type: Enumerated
  allowed_values:
  - Malware
  - Ransomware
  - Trojan
  - Virus
  - Worm
  - Adware
  - Spyware
  - Rootkit
  - Cryptominor
  - Phishing
  - Spam
  - MaliciousUrl
  - Spoofing
  - Security Policy Violation
  - Unknown
  description: 'The category of the threat or malware identified in the alert. Supported values are: Malware, Ransomware, Trojan, Virus, Worm, Adware, Spyware, Rootkit, Cryptominor, Phishing, Spam, MaliciousUrl, Spoofing, Security Policy Violation, Unknown'
- name: Username
  role: user
  class: Recommended
  type: Username (string)
  description: Name of the user associated with the alert, including domain information when available. e.g. Contoso\JSmith or john.smith@contoso.com
- name: UserIdType
  role: user
  class: Conditional
  type: Enumerated
  allowed_values:
  - GUID
  - SID
  - Email
  - Username
  - Phone
  - Other
  description: 'The type of the user ID, such as GUID, SID, or Email. Supported values are: - GUID - SID - Email - Username - Phone - Other'
- name: UsernameType
  role: user
  class: Conditional
  type: UsernameType
  description: Specifies the type of the user name stored in the Username field. For more information, and list of allowed values, see UsernameType in the Schema Overview article. e.g. Windows
- name: AdditionalFields
  role: common
  class: Optional
  type: Dynamic
  description: If your source provides additional information worth preserving, either keep it with the original field names or create the dynamic AdditionalFields field, and add the extra information as key/value pairs.
- name: AlertOriginalStatus
  role: alert
  class: Optional
  type: string
  description: The status of the alert as reported by the originating system.
- name: AlertStatus
  role: alert
  class: Optional
  type: Enumerated
  allowed_values:
  - Active
  - Closed
  description: 'Indicates the current state or progress of the alert. Supported values are: - Active - Closed'
- name: AlertVerdict
  role: alert
  class: Optional
  type: Enumerated
  allowed_values:
  - True Positive (Confirmed as a legitimate threat)
  - False Positive (Incorrectly identified as a threat)
  - Benign Positive (when event is determined to be harmless)
  - Unknown (Uncertain or undetermined status)
  description: 'The final determination or outcome of the alert, indicating whether the alert was confirmed as a threat, deemed suspicious, or resolved as a false positive. Supported values are: - True Positive (Confirmed as a legitimate threat) - False Positive (Incorrectly identified as a threat) - Benign Positive (when event is determined to be harmless) - Unknown (Uncertain or undetermined status)'
- name: DetectionMethod
  class: Optional
  type: Enumerated
  allowed_values:
  - EDR
  - Behavioral Analytics
  - Reputation
  - Threat Intelligence
  - Intrusion Detection
  - Automated Investigation
  - Antivirus
  - Data Loss Prevention
  - User Defined Blocked List
  - Cloud Security Posture Management
  - Cloud Application Security
  - Scheduled Alerts
  - Other
  description: 'Provides detailed information about the specific detection method, technology, or data source that contributed to the generation of the alert. This field offers greater insight into how the alert was detected or triggered, aiding in the understanding of the detection context and reliability. Supported values include: - EDR: Endpoint Detection and Response systems that monitor and analyze endpoint activities to identify threats. - Behavioral Analytics: Techniques that detect abnormal patterns in user, device, or system behavior. - Reputation: Threat detection based on the reputation of IP addresses, domains, or files. - Threat Intelligence: External or internal intelligence feeds providing data on known threats or adversary tactics. - Intrusion Detection: Systems that monitor network traffic or activities for signs of intrusions or attacks. - Automated Investigation: Automated systems that analyze and investigate alerts, reducing manual workload. - Antivirus: Traditional antivirus engines that detect malware based on signatures and heuristics. - Data Loss Prevention: Solutions focused on preventing unauthorized data transfers or leaks. - User Defined Blocked List: Custom lists defined by users to block specific IPs, domains, or files. - Cloud Security Posture Management: Tools that assess and manage security risks in cloud environments. - Cloud Application Security: Solutions that secure cloud applications and data. -Scheduled Alerts: Alerts generated based on predefined schedules or thresholds. - Other: Any other detection method not covered by the above categories.'
- name: DvcAction
  role: device
  class: Optional
  type: String
  description: For reporting security systems, the action taken by the system, if applicable.
  examples:
  - Blocked
- name: DvcDescription
  role: device
  class: Optional
  type: String
  description: A descriptive text associated with the device.
  examples:
  - Primary Domain Controller
- name: DvcInterface
  role: device
  class: Optional
  type: String
  description: The network interface on which data was captured. This field is typically relevant to network related activity, which is captured by an intermediate or tap device.
- name: DvcMacAddr
  role: device
  class: Optional
  type: MAC address
  description: The MAC address of the device on which the event occurred or which reported the event.
  examples:
  - 00:1B:44:11:3A:B7
- name: DvcOriginalAction
  role: device
  class: Optional
  type: String
  description: The original DvcAction as provided by the reporting device.
- name: DvcOs
  role: device
  class: Optional
  type: String
  description: The operating system running on the device on which the event occurred or which reported the event.
  examples:
  - Windows
- name: DvcOsVersion
  role: device
  class: Optional
  type: String
  description: The version of the operating system on the device on which the event occurred or which reported the event.
  examples:
  - '10'
- name: DvcScope
  role: device
  class: Optional
  type: String
  description: The cloud platform scope the device belongs to. DvcScope map to a subscription ID on Azure and to an account ID on AWS.
- name: DvcScopeId
  role: device
  class: Optional
  type: String
  description: The cloud platform scope ID the device belongs to. DvcScopeId map to a subscription ID on Azure and to an account ID on AWS.
- name: DvcZone
  role: device
  class: Optional
  type: String
  description: The network on which the event occurred or which reported the event, depending on the schema. The zone is defined by the reporting device.
  examples:
  - Dmz
- name: EmailMessageId
  class: Optional
  type: string
  description: Unique identifier for the email message, associated with the alert. e.g. Request for Invoice Access
- name: EmailSubject
  class: Optional
  type: string
  description: Subject of the email. e.g. j5kl6mn7-op8q-r9st-0uv1-wx2yz3ab4c
- name: EventMessage
  role: common
  class: Optional
  type: string
  description: Detailed information about the alert, including its context, cause, and potential impact. e.g. Potential use of the Rubeus tool for kerberoasting, a technique used to extract service account credentials from Kerberos tickets.
- name: EventOriginalSeverity
  role: common
  class: Optional
  type: String
  description: The original severity as provided by the reporting device. This value is used to derive EventSeverity.
- name: EventOriginalSubType
  role: common
  class: Optional
  type: String
  description: The original event subtype or ID, if provided by the source. For example, this field is used to store the original Windows logon type. This value is used to derive EventSubType, which should have only one of the values documented for each schema.
  examples:
  - '2'
- name: EventOriginalType
  role: common
  class: Optional
  type: String
  description: The original event type or ID, if provided by the source. For example, this field is used to store the original Windows event ID. This value is used to derive EventType, which should have only one of the values documented for each schema.
  examples:
  - '4624'
- name: EventOriginalUid
  role: common
  class: Optional
  type: String
  description: A unique ID of the original record, if provided by the source.
  examples:
  - 69f37748-ddcd-4331-bf0f-b137f1ea83b
- name: EventOwner
  role: common
  class: Optional
  type: String
  description: The owner of the event, which is usually the department or subsidiary in which it was generated.
- name: EventProductVersion
  role: common
  class: Optional
  type: String
  description: The version of the product generating the event.
  examples:
  - '12.1'
- name: EventReportUrl
  role: common
  class: Optional
  type: URL (String)
  description: A URL provided in the event for a resource that provides more information about the event.
- name: EventResult
  role: common
  class: Optional
  type: Enumerated
  description: 'One of the following values: Success, Partial, Failure, NA (Not Applicable). The value might be provided in the source record by using different terms, which should be normalized to these values. Alternatively, the source might provide only the EventResultDetails field, which should be analyzed to derive the EventResult value.'
  examples:
  - Success
- name: FileMD5
  role: file
  class: Optional
  type: string
  description: MD5 hash of the file. e.g. j5kl6mn7op8qr9st0uv1wx2yz3ab4c
- name: FileName
  role: file
  class: Optional
  type: string
  description: Name of the file associated with the alert, without path or a location. e.g. Notepad.exe
- name: FilePath
  role: file
  class: Optional
  type: string
  description: The full, normalized path of the target file, including the folder or location, the file name, and the extension. e.g. C:\Windows\System32\notepad.exe
- name: FileSHA1
  role: file
  class: Optional
  type: string
  description: SHA1 hash of the file. e.g. j5kl6mn7op8qr9st0uv1
- name: FileSHA256
  role: file
  class: Optional
  type: string
  description: SHA256 hash of the file. e.g. a1bc2de3fh4ij5kl6mn7op8qrs2de3
- name: FileSize
  role: file
  class: Optional
  type: long
  description: Size of the file in bytes. e.g. 123456
- name: IndicatorAssociation
  class: Optional
  type: Enumerated
  allowed_values:
  - Associated
  - Targeted
  description: 'Specifies whether the indicator is linked to or directly impacted by the threat. Supported values are: -Associated -Targeted'
- name: OriginalUserType
  class: Optional
  type: string
  description: The user type as reported by the reporting device.
- name: ProcessCommandLine
  role: process
  class: Optional
  type: string
  description: Command line used to start the process. e.g. "choco.exe" -v
- name: ProcessFileCompany
  role: file
  class: Optional
  type: string
  description: Company that created the process image file. e.g. Microsoft
- name: ProcessId
  role: process
  class: Optional
  type: string
  description: The process ID (PID) associated with the alert. e.g. 12345678
  examples:
  - '48610176'
  notes: The type is defined as string to support varying systems, but on Windows and Linux this value must be numeric. If you are using a Windows or Linux machine and used a different type, make sure to convert the values. For example, if you used a hexadecimal value, convert it to a decimal value.
- name: ProcessName
  role: process
  class: Optional
  type: string
  description: Name of the process. e.g. C:\Windows\explorer.exe
  examples:
  - C:\Windows\explorer.exe
- name: RegistryKey
  role: registry
  class: Optional
  type: string
  description: The registry key associated with the alert, normalized to standard root key naming conventions. e.g. HKEY_LOCAL_MACHINE\SOFTWARE\MTG
- name: RegistryValue
  role: registry
  class: Optional
  type: string
  description: Registry value. e.g. ImagePath
- name: RegistryValueData
  role: registry
  class: Optional
  type: string
  description: Data of the registry value. e.g. C:\Windows\system32;C:\Windows;
- name: RegistryValueType
  role: registry
  class: Optional
  type: Enumerated
  description: Type of the registry value. e.g. Reg_Expand_Sz
- name: RuleDescription
  role: rule
  class: Optional
  type: string
  description: Description of the rule associated with the alert. e.g. This rule detects remote execution on a server using PSEXEC, which may indicate unauthorized administrative activity or lateral movement within the network
- name: RuleName
  role: rule
  class: Optional
  type: string
  description: The name or ID of the rule associated with the alert. e.g. Server PSEXEC Execution via Remote Access
- name: RuleNumber
  role: rule
  class: Optional
  type: int
  description: The number of the rule associated with the alert. e.g. 123456
- name: ThreatConfidence
  role: threat
  class: Optional
  type: ConfidenceLevel (Integer)
  description: The confidence level of the threat identified, normalized to a value between 0 and a 100.
- name: ThreatFirstReportedTime
  role: threat
  class: Optional
  type: datetime
  description: Date and time when the threat was first reported. e.g. 2024-09-19T10:12:10.0000000Z
- name: ThreatId
  role: threat
  class: Optional
  type: string
  description: The ID of the threat or malware identified in the alert. e.g. 1234567891011121314
- name: ThreatIsActive
  role: threat
  class: Optional
  type: bool
  allowed_values:
  - 'True'
  - 'False'
  description: 'Indicates whether the threat is currently active. Supported values are: True, False'
- name: ThreatLastReportedTime
  role: threat
  class: Optional
  type: datetime
  description: Date and time when the threat was last reported. e.g. 2024-09-19T10:12:10.0000000Z
- name: ThreatName
  role: threat
  class: Optional
  type: string
  description: The name of the threat or malware identified in the alert. e.g. Init.exe
- name: ThreatOriginalCategory
  role: threat
  class: Optional
  type: string
  description: The category of the threat as reported by the originating system.
- name: ThreatOriginalConfidence
  role: threat
  class: Optional
  type: string
  description: The confidence level as reported by the originating system.
- name: ThreatOriginalRiskLevel
  role: threat
  class: Optional
  type: string
  description: The risk level as reported by the originating system.
- name: ThreatRiskLevel
  role: threat
  class: Optional
  type: RiskLevel (Integer)
  description: 'The risk level associated with the threat. The level should be a number between 0 and 100. Note: The value might be provided in the source record by using a different scale, which should be normalized to this scale. The original value should be stored in ThreatRiskLevelOriginal.'
- name: Url
  role: web
  class: Optional
  type: string
  description: The URL string captured in the alert. e.g. https://contoso.com/fo/?k=v&q=u#f
- name: UserId
  role: user
  class: Optional
  type: string
  description: A machine-readable, alphanumeric, unique representation of the user associated with the alert. e.g. A1bC2dE3fH4iJ5kL6mN7o
- name: UserScope
  role: user
  class: Optional
  type: string
  description: The scope, such as Microsoft Entra tenant, in which UserId and Username are defined. For more information and list of allowed values, see UserScope in the Schema Overview article. e.g. Contoso Directory
- name: UserScopeId
  role: user
  class: Optional
  type: string
  description: The scope ID, such as Microsoft Entra Directory ID, in which UserId and Username are defined. e.g. a1bc2de3-fh4i-j5kl-6mn7-op8qrs
- name: UserSessionId
  role: user
  class: Optional
  type: string
  description: The unique ID of the user's session associated with the alert. e.g. a1bc2de3-fh4i-j5kl-6mn7-op8qr9st0u
- name: UserType
  role: user
  class: Optional
  type: UserType
  description: The type of the Actor. For more information, and list of allowed values, see UserType in the Schema Overview article. e.g. Guest
- name: AlertDescription
  role: alert
  class: Alias
  type: string
  to:
  - EventMessage
- name: AlertId
  role: alert
  class: Alias
  type: string
  to:
  - EventUid
- name: Hostname
  role: device
  class: Alias
  type: Hostname
  to:
  - DvcHostname
- name: IpAddr
  role: network
  class: Alias
  type: IP address
  to:
  - DvcIpAddr
  examples:
  - 45.21.42.12
- name: Rule
  role: rule
  class: Alias
  type: string
  resolution: Either the value of RuleName or the value of RuleNumber. If the value of RuleNumber is used, the type should be converted to string.
- name: User
  role: user
  class: Alias
  type: string
  to:
  - Username
