name: DhcpEvent
title: DHCP Activity
kind: event
version: 0.1.1
status: GA
summary: The DHCP information model is used to describe events reported by a DHCP server, and is used by Microsoft Sentinel to enable source-agnostic analytics. For more information, see Normalization and the Advanced Security Information Model (ASIM).
fields:
- name: Dvc
  role: device
  class: Mandatory
  type: '-'
  to:
  - DvcFQDN
  - DvcHostname
  - DvcId
  - DvcIpAddr
  description: For DHCP events, device fields refer to the system that reports the DHCP event.
- name: EventCount
  role: common
  class: Mandatory
  type: Integer
  description: The number of events described by the record. This value is used when the source supports aggregation, and a single record might represent multiple events. For other sources, set to 1.
- name: EventEndTime
  role: common
  class: Mandatory
  type: Date/time
  to:
  - TimeGenerated
  description: The time when the event ended. If the source supports aggregation and the record represents multiple events, the time that the last event was generated. If not provided by the source record, this field aliases the TimeGenerated field.
- name: EventProduct
  role: common
  class: Mandatory
  type: String
  description: The product generating the event. The value should be one of the values listed in Vendors and Products.
  examples:
  - Sysmon
- name: EventResult
  role: common
  class: Mandatory
  type: Enumerated
  description: 'One of the following values: Success, Partial, Failure, NA (Not Applicable). The value might be provided in the source record by using different terms, which should be normalized to these values. Alternatively, the source might provide only the EventResultDetails field, which should be analyzed to derive the EventResult value.'
  examples:
  - Success
- name: EventSchema
  role: common
  class: Mandatory
  type: String
  value: DhcpEvent
  description: The name of the schema documented here's DhcpEvent.
- name: EventSchemaVersion
  role: common
  class: Mandatory
  type: SchemaVersion (String)
  value: 0.1.1
  description: The version of the schema documented here's 0.1.1.
- name: EventStartTime
  role: common
  class: Mandatory
  type: Date/time
  to:
  - TimeGenerated
  description: The time when the event started. If the source supports aggregation and the record represents multiple events, the time that the first event was generated. If not provided by the source record, this field aliases the TimeGenerated field.
- name: EventType
  role: common
  class: Mandatory
  type: Enumerated
  allowed_values:
  - Assign
  - Renew
  - Release
  - DNS Update
  description: Indicate the operation reported by the record. Possible values are Assign, Renew, Release, and DNS Update.
  examples:
  - Assign
- name: EventVendor
  role: common
  class: Mandatory
  type: String
  description: The vendor of the product generating the event. The value should be one of the values listed in Vendors and Products.
  examples:
  - Microsoft
- name: SrcHostname
  role: source
  class: Mandatory
  type: Hostname (String)
  description: The hostname of the device requesting the DHCP lease. If no device name is available, store the relevant IP address in this field.
  examples:
  - DESKTOP-1282V4D
- name: SrcIpAddr
  role: source
  class: Mandatory
  type: IP Address
  description: The IP address assigned to the client by the DHCP server.
  examples:
  - 192.168.12.1
  - 45.21.42.12
- name: SrcMacAddr
  role: source
  class: Mandatory
  type: Mac Address
  description: The MAC address of the client requesting a DHCP lease.
  examples:
  - 06:10:9f:eb:8f:14
  - 00:1B:44:11:3A:B7
  notes: The Windows DHCP server logs MAC address in a nonstandard way, omitting the colons, which should be inserted by the parser.
- name: DvcAction
  role: device
  class: Recommended
  type: String
  description: For reporting security systems, the action taken by the system, if applicable.
  examples:
  - Blocked
- name: DvcDomain
  role: device
  class: Recommended
  type: Domain (String)
  description: The domain of the device on which the event occurred or which reported the event, depending on the schema.
  examples:
  - Contoso
- name: DvcDomainType
  role: device
  class: Recommended
  type: Enumerated
  required_if:
  - the DvcDomain field is used
  description: The type of DvcDomain. For a list of allowed values and further information, refer to DomainType.
  notes: This field is required if the DvcDomain field is used.
- name: DvcFQDN
  role: device
  class: Recommended
  type: FQDN (String)
  description: The hostname of the device on which the event occurred or which reported the event, depending on the schema.
  examples:
  - Contoso\DESKTOP-1282V4D
  notes: This field supports both traditional FQDN format and Windows domain\hostname format. The DvcDomainType field reflects the format used.
- name: DvcHostname
  role: device
  class: Recommended
  type: Hostname
  description: The hostname of the device on which the event occurred or which reported the event, depending on the schema.
  examples:
  - ContosoDc
- name: DvcId
  role: device
  class: Recommended
  type: String
  description: The unique ID of the device on which the event occurred or which reported the event, depending on the schema. If multiple IDs are available, use the first one from the list, and store the others by using the field names DvcAzureResourceId, DvcMDEid, etc.
  examples:
  - 41502da5-21b7-48ec-81c9-baeea8d7d669
- name: DvcIdType
  role: device
  class: Recommended
  type: Enumerated
  required_if:
  - the DvcId field is used
  allowed_values:
  - AzureResourceId
  - MDEid
  - MD4IoTid
  - VMConnectionId
  - AwsVpcId
  - VectraId
  - AppGateId
  - FQDN
  - Other
  description: The type of DvcId. The list of allowed values is AzureResourceId, MDEid, MD4IoTid, VMConnectionId, AwsVpcId, VectraId, AppGateId, FQDN, and Other. Using FQDN as a device ID, implies reusing the hostname. Use it only as a last resort.
  notes: This field is required if the DvcId field is used.
- name: DvcIpAddr
  role: device
  class: Recommended
  type: IP address
  description: The IP address of the device on which the event occurred or which reported the event, depending on the schema.
  examples:
  - 45.21.42.12
- name: EventResultDetails
  role: common
  class: Recommended
  type: Enumerated
  description: Reason or details for the result reported in the EventResult field. Each schema documents the list of values valid for this field. The original, source specific, value is stored in the EventOriginalResultDetails field.
  examples:
  - NXDOMAIN
- name: EventSeverity
  role: common
  class: Recommended
  type: Enumerated
  description: 'The severity of the event. Valid values are: Informational, Low, Medium, or High.'
- name: EventUid
  role: common
  class: Recommended
  type: String
  description: The unique ID of the record, as assigned by Microsoft Sentinel. This field is typically mapped to the _ItemId Log Analytics field.
- name: SrcDomain
  role: source
  class: Recommended
  type: Domain (String)
  description: The domain of the source device.
  examples:
  - Contoso
- name: SrcDomainType
  role: source
  class: Conditional
  type: Enumerated
  required_if:
  - SrcDomain is used
  allowed_values:
  - Windows (such as
  - FQDN (such as
  description: 'The type of SrcDomain, if known. Possible values include: - Windows (such as: contoso) - FQDN (such as: microsoft.com) Required if SrcDomain is used.'
- name: SrcDvcIdType
  role: source
  class: Conditional
  type: Enumerated
  required_if:
  - SrcDvcId is used
  allowed_values:
  - AzureResourceId
  - MDEid
  description: 'The type of SrcDvcId, if known. Possible values include: - AzureResourceId - MDEid If multiple IDs are available, use the first one from the list above, and store the others in the SrcDvcAzureResourceId and SrcDvcMDEid, respectively.'
  notes: This field is required if SrcDvcId is used.
- name: SrcUserIdType
  role: source
  class: Conditional
  type: UserIdType
  description: The type of the ID stored in the SrcUserId field. For more information and list of allowed values, see UserIdType in the Schema Overview article.
- name: SrcUsernameType
  role: source
  class: Conditional
  type: UsernameType
  description: Specifies the type of the user name stored in the SrcUsername field. For more information, and list of allowed values, see UsernameType in the Schema Overview article.
  examples:
  - Windows
- name: AdditionalFields
  role: common
  class: Optional
  type: Dynamic
  description: If your source provides additional information worth preserving, either keep it with the original field names or create the dynamic AdditionalFields field, and add the extra information as key/value pairs.
- name: DhcpCircuitId
  role: dhcp
  class: Optional
  type: String
  description: The DHCP circuit ID, as defined by RFC3046
- name: DhcpLeaseDuration
  role: dhcp
  class: Optional
  type: Integer
  description: The length of the lease granted to a client, in seconds.
- name: DhcpSessionDuration
  role: dhcp
  class: Optional
  type: Integer
  description: The amount of time, in milliseconds, for the completion of the DHCP session.
  examples:
  - '1500'
- name: DhcpSessionId
  role: dhcp
  class: Optional
  type: string
  description: The session identifier as reported by the reporting device. For the Windows DHCP server, set this to the TransactionID field.
  examples:
  - '2099570186'
- name: DhcpSrcDHCId
  role: dhcp
  class: Optional
  type: String
  description: The DHCP client ID, as defined by RFC4701
- name: DhcpSubscriberId
  role: dhcp
  class: Optional
  type: String
  description: The DHCP subscriber ID, as defined by RFC3993
- name: DhcpUserClass
  role: dhcp
  class: Optional
  type: String
  description: The DHCP User Class, as defined by RFC3004.
- name: DhcpUserClassId
  role: dhcp
  class: Optional
  type: String
  description: The DHCP User Class ID, as defined by RFC3004.
- name: DhcpVendorClass
  role: dhcp
  class: Optional
  type: String
  description: The DHCP Vendor Class, as defined by RFC3925.
- name: DhcpVendorClassId
  role: dhcp
  class: Optional
  type: String
  description: The DHCP Vendor Class Id, as defined by RFC3925.
- name: DvcDescription
  role: device
  class: Optional
  type: String
  description: A descriptive text associated with the device.
  examples:
  - Primary Domain Controller
- name: DvcInterface
  role: device
  class: Optional
  type: String
  description: The network interface on which data was captured. This field is typically relevant to network related activity, which is captured by an intermediate or tap device.
- name: DvcMacAddr
  role: device
  class: Optional
  type: MAC address
  description: The MAC address of the device on which the event occurred or which reported the event.
  examples:
  - 00:1B:44:11:3A:B7
- name: DvcOriginalAction
  role: device
  class: Optional
  type: String
  description: The original DvcAction as provided by the reporting device.
- name: DvcOs
  role: device
  class: Optional
  type: String
  description: The operating system running on the device on which the event occurred or which reported the event.
  examples:
  - Windows
- name: DvcOsVersion
  role: device
  class: Optional
  type: String
  description: The version of the operating system on the device on which the event occurred or which reported the event.
  examples:
  - '10'
- name: DvcScope
  role: device
  class: Optional
  type: String
  description: The cloud platform scope the device belongs to. DvcScope map to a subscription ID on Azure and to an account ID on AWS.
- name: DvcScopeId
  role: device
  class: Optional
  type: String
  description: The cloud platform scope ID the device belongs to. DvcScopeId map to a subscription ID on Azure and to an account ID on AWS.
- name: DvcZone
  role: device
  class: Optional
  type: String
  description: The network on which the event occurred or which reported the event, depending on the schema. The zone is defined by the reporting device.
  examples:
  - Dmz
- name: EventMessage
  role: common
  class: Optional
  type: String
  description: A general message or description, either included in or generated from the record.
- name: EventOriginalResultDetails
  role: common
  class: Optional
  type: String
  description: The original result details provided by the source. This value is used to derive EventResultDetails, which should have only one of the values documented for each schema.
- name: EventOriginalSeverity
  role: common
  class: Optional
  type: String
  description: The original severity as provided by the reporting device. This value is used to derive EventSeverity.
- name: EventOriginalSubType
  role: common
  class: Optional
  type: String
  description: The original event subtype or ID, if provided by the source. For example, this field is used to store the original Windows logon type. This value is used to derive EventSubType, which should have only one of the values documented for each schema.
  examples:
  - '2'
- name: EventOriginalType
  role: common
  class: Optional
  type: String
  description: The original event type or ID, if provided by the source. For example, this field is used to store the original Windows event ID. This value is used to derive EventType, which should have only one of the values documented for each schema.
  examples:
  - '4624'
- name: EventOriginalUid
  role: common
  class: Optional
  type: String
  description: A unique ID of the original record, if provided by the source.
  examples:
  - 69f37748-ddcd-4331-bf0f-b137f1ea83b
- name: EventOwner
  role: common
  class: Optional
  type: String
  description: The owner of the event, which is usually the department or subsidiary in which it was generated.
- name: EventProductVersion
  role: common
  class: Optional
  type: String
  description: The version of the product generating the event.
  examples:
  - '12.1'
- name: EventReportUrl
  role: common
  class: Optional
  type: URL (String)
  description: A URL provided in the event for a resource that provides more information about the event.
- name: EventSubType
  role: common
  class: Optional
  type: Enumerated
  description: Describes a subdivision of the operation reported in the EventType field. Each schema documents the list of values valid for this field. The original, source specific, value is stored in the EventOriginalSubType field.
- name: RequestedIpAddr
  class: Optional
  type: IP Address
  description: The IP address requested by the DHCP client, when available.
  examples:
  - 192.168.12.3
- name: RuleName
  role: rule
  class: Optional
  type: string
  description: The name or ID of the rule associated with the alert. e.g. Server PSEXEC Execution via Remote Access
- name: RuleNumber
  role: rule
  class: Optional
  type: int
  description: The number of the rule associated with the alert. e.g. 123456
- name: SrcDescription
  role: source
  class: Optional
  type: String
  description: A descriptive text associated with the device.
  examples:
  - Primary Domain Controller
- name: SrcDeviceType
  role: source
  class: Optional
  type: Enumerated
  allowed_values:
  - Computer
  - Mobile Device
  - IOT Device
  - Other
  description: 'The type of the source device. Possible values include: - Computer - Mobile Device - IOT Device - Other'
- name: SrcDvcId
  role: source
  class: Optional
  type: String
  description: The ID of the source device as reported in the record.
  examples:
  - ac7e9755-8eae-4ffc-8a02-50ed7a2216c3
  - 41502da5-21b7-48ec-81c9-baeea8d7d669
- name: SrcDvcScope
  role: source
  class: Optional
  type: String
  description: The cloud platform scope the device belongs to. SrcDvcScope map to a subscription ID on Azure and to an account ID on AWS.
- name: SrcDvcScopeId
  role: source
  class: Optional
  type: String
  description: The cloud platform scope ID the device belongs to. SrcDvcScopeId map to a subscription ID on Azure and to an account ID on AWS.
- name: SrcFQDN
  role: source
  class: Optional
  type: FQDN (String)
  description: The source device hostname, including domain information when available.
  examples:
  - Contoso\DESKTOP-1282V4D
  notes: This field supports both traditional FQDN format and Windows domain\hostname format. The SrcDomainType field reflects the format used.
- name: SrcGeoCity
  role: source
  class: Optional
  type: City
  description: The city associated with the source IP address.
  examples:
  - Burlington
- name: SrcGeoCountry
  role: source
  class: Optional
  type: Country
  description: The country/region associated with the source IP address.
  examples:
  - USA
- name: SrcGeoLatitude
  role: source
  class: Optional
  type: Latitude
  description: The latitude of the geographical coordinate associated with the source IP address.
  examples:
  - '44.475833'
- name: SrcGeoLongitude
  role: source
  class: Optional
  type: Longitude
  description: The longitude of the geographical coordinate associated with the source IP address.
  examples:
  - '73.211944'
- name: SrcGeoRegion
  role: source
  class: Optional
  type: Region
  description: The region associated with the source IP address.
  examples:
  - Vermont
- name: SrcOriginalRiskLevel
  role: source
  class: Optional
  type: String
  description: The risk level associated with the source, as reported by the reporting device.
  examples:
  - Suspicious
- name: SrcOriginalUserType
  role: source
  class: Optional
  type: String
  description: The original source user type, if provided by the source.
- name: SrcPortNumber
  role: source
  class: Optional
  type: Integer
  description: The IP port from which the connection originated. Might not be relevant for a session comprising multiple connections.
  examples:
  - '2335'
- name: SrcRiskLevel
  role: source
  class: Optional
  type: Integer
  description: The risk level associated with the source. The value should be adjusted to a range of 0 to 100, with 0 for benign and 100 for a high risk.
  examples:
  - '90'
- name: SrcUserId
  role: source
  class: Optional
  type: String
  description: A machine-readable, alphanumeric, unique representation of the source user. For more information, and for alternative fields for additional IDs, see The User entity.
  examples:
  - S-1-12-1-4141952679-1282074057-627758481-2916039507
- name: SrcUsername
  role: source
  class: Optional
  type: Username (String)
  description: The source username, including domain information when available. For more information, see The User entity.
  examples:
  - AlbertE
- name: SrcUserScope
  role: source
  class: Optional
  type: String
  description: The scope, such as Microsoft Entra tenant, in which SrcUserId and SrcUsername are defined. or more information and list of allowed values, see UserScope in the Schema Overview article.
- name: SrcUserScopeId
  role: source
  class: Optional
  type: String
  description: The scope ID, such as Microsoft Entra Directory ID, in which SrcUserId and SrcUsername are defined. for more information and list of allowed values, see UserScopeId in the Schema Overview article.
- name: SrcUserSessionId
  role: source
  class: Optional
  type: String
  description: The unique ID of the sign-in session of the Actor.
  examples:
  - 102pTUgC3p8RIqHvzxLCHnFlg
- name: SrcUserType
  role: source
  class: Optional
  type: UserType
  description: The type of the source user. For more information, and list of allowed values, see UserType in the Schema Overview article.
  examples:
  - Guest
- name: ThreatCategory
  role: threat
  class: Optional
  type: String
  allowed_values:
  - Malware
  - Ransomware
  - Trojan
  - Virus
  - Worm
  - Adware
  - Spyware
  - Rootkit
  - Cryptominor
  - Phishing
  - Spam
  - MaliciousUrl
  - Spoofing
  - Security Policy Violation
  - Unknown
  description: 'The category of the threat or malware identified in the alert. Supported values are: Malware, Ransomware, Trojan, Virus, Worm, Adware, Spyware, Rootkit, Cryptominor, Phishing, Spam, MaliciousUrl, Spoofing, Security Policy Violation, Unknown'
- name: ThreatConfidence
  role: threat
  class: Optional
  type: ConfidenceLevel (Integer)
  description: The confidence level of the threat identified, normalized to a value between 0 and a 100.
- name: ThreatFirstReportedTime
  role: threat
  class: Optional
  type: Date/Time
  description: Date and time when the threat was first reported. e.g. 2024-09-19T10:12:10.0000000Z
- name: ThreatId
  role: threat
  class: Optional
  type: string
  description: The ID of the threat or malware identified in the alert. e.g. 1234567891011121314
- name: ThreatIsActive
  role: threat
  class: Optional
  type: bool
  allowed_values:
  - 'True'
  - 'False'
  description: 'Indicates whether the threat is currently active. Supported values are: True, False'
- name: ThreatLastReportedTime
  role: threat
  class: Optional
  type: Date/Time
  description: Date and time when the threat was last reported. e.g. 2024-09-19T10:12:10.0000000Z
- name: ThreatName
  role: threat
  class: Optional
  type: string
  description: The name of the threat or malware identified in the alert. e.g. Init.exe
- name: ThreatOriginalConfidence
  role: threat
  class: Optional
  type: string
  description: The confidence level as reported by the originating system.
- name: ThreatOriginalRiskLevel
  role: threat
  class: Optional
  type: string
  description: The risk level as reported by the originating system.
- name: ThreatRiskLevel
  role: threat
  class: Optional
  type: RiskLevel (Integer)
  description: 'The risk level associated with the threat. The level should be a number between 0 and 100. Note: The value might be provided in the source record by using a different scale, which should be normalized to this scale. The original value should be stored in ThreatRiskLevelOriginal.'
- name: Duration
  role: network
  class: Alias
  to:
  - DhcpSessionDuration
- name: Hostname
  role: device
  class: Alias
  type: Hostname
  to:
  - SrcHostname
- name: IpAddr
  role: network
  class: Alias
  type: IP address
  to:
  - SrcIpAddr
  examples:
  - 45.21.42.12
- name: Rule
  role: rule
  class: Alias
  type: string
  resolution: Either the value of RuleName or the value of RuleNumber. If the value of RuleNumber is used, the type should be converted to string.
- name: SessionId
  role: session
  class: Alias
  type: String
  to:
  - DhcpSessionId
- name: Src
  role: source
  class: Alias
  type: String
  to:
  - SrcDvcId
  - SrcHostname
  - SrcIpAddr
  resolution: A unique identifier of the source device. This field might alias the SrcDvcId, SrcHostname, or SrcIpAddr fields.
  examples:
  - 192.168.12.1
- name: User
  role: user
  class: Alias
  to:
  - SrcUsername
