name: Authentication
title: Authentication Event
kind: event
version: 0.1.4
status: GA
summary: The Microsoft Sentinel Authentication schema is used to describe events related to user authentication, sign-in, and sign-out. Authentication events are sent by many reporting devices, usually as part of the event stream alongside other events. For example, Windows sends several authentication events alongside other OS activity events. Authentication events include both events from systems that focus on authentication such as VPN gateways or domain controllers, and direct authentication to an end system, such as a computer or firewall. For more information about normalization in Microsoft Sentinel, see Normalization and the Advanced Security Information Model (ASIM).
fields:
- name: Dvc
  role: device
  class: Mandatory
  type: '-'
  description: For authentication events, device fields refer to the system reporting the event.
- name: EventCount
  role: common
  class: Mandatory
- name: EventEndTime
  role: common
  class: Mandatory
- name: EventProduct
  role: common
  class: Mandatory
- name: EventResult
  role: common
  class: Mandatory
- name: EventSchema
  role: common
  class: Mandatory
  type: Enumerated
  value: Authentication
  description: The name of the schema documented here is Authentication.
- name: EventSchemaVersion
  role: common
  class: Mandatory
  type: SchemaVersion (String)
  value: 0.1.4
  description: The version of the schema. The version of the schema documented here is 0.1.4
- name: EventStartTime
  role: common
  class: Mandatory
- name: EventType
  role: common
  class: Mandatory
  type: Enumerated
  allowed_values:
  - Logon
  - Logoff
  - Elevate
  description: 'Describes the operation reported by the record. For Authentication records, supported values include: - Logon - Logoff - Elevate'
- name: EventVendor
  role: common
  class: Mandatory
- name: DvcAction
  role: device
  class: Recommended
- name: DvcDomain
  role: device
  class: Recommended
- name: DvcDomainType
  role: device
  class: Recommended
- name: DvcFQDN
  role: device
  class: Recommended
- name: DvcHostname
  role: device
  class: Recommended
- name: DvcId
  role: device
  class: Recommended
- name: DvcIdType
  role: device
  class: Recommended
- name: DvcIpAddr
  role: device
  class: Recommended
- name: EventResultDetails
  role: common
  class: Recommended
  type: Enumerated
  allowed_values:
  - No such user or password. This value should be used also when the original event reports that there is no such user, without reference to a password
  - No such user
  - Incorrect password
  - Incorrect key
  - Account expired
  - Password expired
  - User locked
  - User disabled
  - Logon violates policy. This value should be used when the original event reports, for example
  - Session expired
  - Other
  description: 'The details associated with the event result. This field is typically populated when the result is a failure. Allowed values include: - No such user or password. This value should be used also when the original event reports that there is no such user, without reference to a password. - No such user - Incorrect password - Incorrect key - Account expired - Password expired - User locked - User disabled - Logon violates policy. This value should be used when the original event reports, for - Session expired - Other The value may be provided in the source record using different terms, which should be normalized to these values. The original value should be stored in the field EventOriginalResultDetails'
  examples:
  - MFA required, log on outside of working hours, conditional access restrictions, or too frequent attempts.
- name: EventSeverity
  role: common
  class: Recommended
- name: EventUid
  role: common
  class: Recommended
- name: Src
  role: source
  class: Recommended
  type: String
  to:
  - SrcDvcId
  - SrcHostname
  - SrcIpAddr
  description: A unique identifier of the source device. This field may alias the SrcDvcId, SrcHostname, or SrcIpAddr fields.
  examples:
  - 192.168.12.1
- name: SrcIpAddr
  role: source
  class: Recommended
  type: IP Address
  description: The IP address of the source device.
  examples:
  - 2.2.2.2
- name: TargetDomain
  role: target
  class: Recommended
  type: Domain (String)
  description: The domain of the target device.
  examples:
  - Contoso
- name: TargetHostname
  role: target
  class: Recommended
  type: Hostname
  description: The target device hostname, excluding domain information.
  examples:
  - DESKTOP-1282V4D
- name: ActorUserIdType
  role: actor
  class: Conditional
  type: UserIdType
  description: The type of the ID stored in the ActorUserId field. For more information and list of allowed values, see UserIdType in the Schema Overview article.
- name: ActorUsernameType
  role: actor
  class: Conditional
  type: UsernameType
  description: Specifies the type of the user name stored in the ActorUsername field. For more information, and list of allowed values, see UsernameType in the Schema Overview article.
  examples:
  - Windows
- name: SrcDomainType
  role: source
  class: Conditional
  type: DomainType
  required_if:
  - SrcDomain is used
  description: The type of SrcDomain. For a list of allowed values and further information refer to DomainType in the Schema Overview article. Required if SrcDomain is used.
- name: SrcDvcIdType
  role: source
  class: Conditional
  type: DvcIdType
  required_if:
  - SrcDvcId is used
  description: The type of SrcDvcId. For a list of allowed values and further information refer to DvcIdType in the Schema Overview article.
  notes: This field is required if SrcDvcId is used.
- name: TargetAppType
  role: target
  class: Conditional
  type: AppType
  description: The type of the application authorizing on behalf of the Actor. For more information, and allowed list of values, see AppType in the Schema Overview article.
- name: TargetDomainType
  role: target
  class: Conditional
  type: Enumerated
  required_if:
  - TargetDomain is used
  description: The type of TargetDomain. For a list of allowed values and further information refer to DomainType in the Schema Overview article. Required if TargetDomain is used.
- name: TargetDvcIdType
  role: target
  class: Conditional
  type: Enumerated
  required_if:
  - TargetDeviceId is used
  description: The type of TargetDvcId. For a list of allowed values and further information refer to DvcIdType in the Schema Overview article. Required if TargetDeviceId is used.
- name: TargetUserIdType
  role: target
  class: Conditional
  type: UserIdType
  description: The type of the user ID stored in the TargetUserId field. For more information and list of allowed values, see UserIdType in the Schema Overview article.
  examples:
  - SID
- name: TargetUsernameType
  role: target
  class: Conditional
  type: UsernameType
  description: Specifies the type of the username stored in the TargetUsername field. For more information and list of allowed values, see UsernameType in the Schema Overview article.
- name: ThreatField
  role: threat
  class: Conditional
  type: Enumerated
  allowed_values:
  - SrcIpAddr
  - TargetIpAddr
  description: The field for which a threat was identified. The value is either SrcIpAddr or TargetIpAddr.
- name: ActingAppId
  role: acting
  class: Optional
  type: String
  description: The ID of the application authorizing on behalf of the actor, including a process, browser, or service. For
  examples:
  - '0x12ae8'
- name: ActingAppName
  role: acting
  class: Optional
  type: String
  description: The name of the application authorizing on behalf of the actor, including a process, browser, or service. For
  examples:
  - C:\Windows\System32\svchost.exe
- name: ActingAppType
  role: acting
  class: Optional
  type: AppType
  description: The type of acting application. For more information, and allowed list of values, see AppType in the Schema Overview article.
- name: ActingOriginalAppType
  role: acting
  class: Optional
  type: String
  description: The type of the acting application as reported by the reporting device.
- name: ActorOriginalUserType
  role: actor
  class: Optional
  type: String
  description: The user type as reported by the reporting device.
- name: ActorScope
  role: actor
  class: Optional
  type: String
  description: The scope, such as Microsoft Entra tenant, in which ActorUserId and ActorUsername are defined. or more information and list of allowed values, see UserScope in the Schema Overview article.
- name: ActorScopeId
  role: actor
  class: Optional
  type: String
  description: The scope ID, such as Microsoft Entra Directory ID, in which ActorUserId and ActorUsername are defined. for more information and list of allowed values, see UserScopeId in the Schema Overview article.
- name: ActorSessionId
  role: actor
  class: Optional
  type: String
  description: The unique ID of the sign-in session of the Actor.
  examples:
  - 102pTUgC3p8RIqHvzxLCHnFlg
- name: ActorUserId
  role: actor
  class: Optional
  type: String
  description: A machine-readable, alphanumeric, unique representation of the Actor. For more information, and for alternative fields for additional IDs, see The User entity.
  examples:
  - S-1-12-1-4141952679-1282074057-627758481-2916039507
- name: ActorUsername
  role: actor
  class: Optional
  type: Username (String)
  description: "The Actor\u2019s username, including domain information when available. For more information, see The User entity."
  examples:
  - AlbertE
- name: ActorUserType
  role: actor
  class: Optional
  type: UserType
  description: The type of the Actor. For more information, and list of allowed values, see UserType in the Schema Overview article. For
  examples:
  - Guest
- name: AdditionalFields
  role: common
  class: Optional
- name: DvcDescription
  role: device
  class: Optional
- name: DvcInterface
  role: device
  class: Optional
- name: DvcMacAddr
  role: device
  class: Optional
- name: DvcOriginalAction
  role: device
  class: Optional
- name: DvcOs
  role: device
  class: Optional
- name: DvcOsVersion
  role: device
  class: Optional
- name: DvcScope
  role: device
  class: Optional
- name: DvcScopeId
  role: device
  class: Optional
- name: DvcZone
  role: device
  class: Optional
- name: EventMessage
  role: common
  class: Optional
- name: EventOriginalResultDetails
  role: common
  class: Optional
- name: EventOriginalSeverity
  role: common
  class: Optional
- name: EventOriginalSubType
  role: common
  class: Optional
- name: EventOriginalType
  role: common
  class: Optional
- name: EventOriginalUid
  role: common
  class: Optional
- name: EventOwner
  role: common
  class: Optional
- name: EventProductVersion
  role: common
  class: Optional
- name: EventReportUrl
  role: common
  class: Optional
- name: EventSubType
  role: common
  class: Optional
  type: Enumerated
  allowed_values:
  - System
  - Interactive
  - RemoteInteractive
  - Service
  - RemoteService
  - 'Remote: Use when the type of remote sign-in is unknown'
  - 'AssumeRole: Typically used when the event type is Elevate'
  description: 'The sign-in type. Allowed values include: - System - Interactive - RemoteInteractive - Service - RemoteService - Remote - Use when the type of remote sign-in is unknown. - AssumeRole - Typically used when the event type is Elevate. The value may be provided in the source record using different terms, which should be normalized to these values. The original value should be stored in the field EventOriginalSubType.'
- name: HttpUserAgent
  role: http
  class: Optional
  type: String
  description: When authentication is performed over HTTP or HTTPS, this field's value is the user_agent HTTP header provided by the acting application when performing the authentication. For
  examples:
  - Mozilla/5.0 (iPhone; CPU iPhone OS 12_1 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/12.0 Mobile/15E148 Safari/604.1
- name: LogonMethod
  class: Optional
  type: String
  allowed_values:
  - Managed Identity
  - Service Principal
  - Username & Password
  - Multi factor authentication
  - Passwordless
  - PKI
  - PAM
  - Other
  description: 'The method used to perform authentication. Allowed values include: Managed Identity, Service Principal, Username & Password, Multi factor authentication, Passwordless, PKI, PAM, and Other.'
  examples:
  - Managed Identity
- name: LogonProtocol
  class: Optional
  type: String
  description: The protocol used to perform authentication.
  examples:
  - NTLM
- name: RuleName
  role: rule
  class: Optional
  type: String
  description: The name or ID of the rule by associated with the inspection results.
- name: RuleNumber
  role: rule
  class: Optional
  type: Integer
  description: The number of the rule associated with the inspection results.
- name: SrcDescription
  role: source
  class: Optional
  type: String
  description: A descriptive text associated with the device. For
  examples:
  - Primary Domain Controller
- name: SrcDeviceType
  role: source
  class: Optional
  type: DeviceType
  description: The type of the source device. For a list of allowed values and further information refer to DeviceType in the Schema Overview article.
- name: SrcDomain
  role: source
  class: Optional
  type: Domain (String)
  description: The domain of the source device.
  examples:
  - Contoso
- name: SrcDvcId
  role: source
  class: Optional
  type: String
  description: The ID of the source device. If multiple IDs are available, use the most important one, and store the others in the fields SrcDvc.
  examples:
  - ac7e9755-8eae-4ffc-8a02-50ed7a2216c3
- name: SrcDvcOs
  role: source
  class: Optional
  type: String
  description: The OS of the source device.
  examples:
  - Windows 10
- name: SrcDvcScope
  role: source
  class: Optional
  type: String
  description: The cloud platform scope the device belongs to. SrcDvcScope map to a subscription ID on Azure and to an account ID on AWS.
- name: SrcDvcScopeId
  role: source
  class: Optional
  type: String
  description: The cloud platform scope ID the device belongs to. SrcDvcScopeId map to a subscription ID on Azure and to an account ID on AWS.
- name: SrcFQDN
  role: source
  class: Optional
  type: FQDN (String)
  description: The source device hostname, including domain information when available.
  examples:
  - Contoso\DESKTOP-1282V4D
  notes: This field supports both traditional FQDN format and Windows domain\hostname format. The SrcDomainType field reflects the format used.
- name: SrcGeoCity
  role: source
  class: Optional
  type: City
  description: For more information, see Logical types.
  examples:
  - Montreal
- name: SrcGeoCountry
  role: source
  class: Optional
  type: Country
  description: For more information, see Logical types.
  examples:
  - Canada
- name: SrcGeoLatitude
  role: source
  class: Optional
  type: Latitude
  description: For more information, see Logical types.
  examples:
  - '45.505918'
- name: SrcGeoLongitude
  role: source
  class: Optional
  type: Longitude
  description: For more information, see Logical types.
  examples:
  - '-73.614830'
- name: SrcGeoRegion
  role: source
  class: Optional
  type: Region
  description: For more information, see Logical types.
  examples:
  - Quebec
- name: SrcHostname
  role: source
  class: Optional
  type: Hostname
  description: The source device hostname, excluding domain information. If no device name is available, store the relevant IP address in this field.
  examples:
  - DESKTOP-1282V4D
- name: SrcIsp
  role: source
  class: Optional
  type: String
  description: The Internet Service Provider (ISP) used by the source device to connect to the internet.
  examples:
  - corpconnect
- name: SrcOriginalRiskLevel
  role: source
  class: Optional
  type: String
  description: The risk level associated with the source, as reported by the reporting device.
  examples:
  - Suspicious
- name: SrcPortNumber
  role: source
  class: Optional
  type: Integer
  description: The IP port from which the connection originated.
  examples:
  - '2335'
- name: SrcRiskLevel
  role: source
  class: Optional
  type: Integer
  description: The risk level associated with the source. The value should be adjusted to a range of 0 to 100, with 0 for benign and 100 for a high risk.
  examples:
  - '90'
- name: TargetAppId
  role: target
  class: Optional
  type: String
  description: The ID of the application to which the authorization is required, often assigned by the reporting device.
  examples:
  - '89162'
- name: TargetAppName
  role: target
  class: Optional
  type: String
  description: The name of the application to which the authorization is required, including a service, a URL, or a SaaS application.
  examples:
  - Saleforce
- name: TargetDescription
  role: target
  class: Optional
  type: String
  description: A descriptive text associated with the device. For
  examples:
  - Primary Domain Controller
- name: TargetDeviceType
  role: target
  class: Optional
  type: Enumerated
  description: The type of the target device. For a list of allowed values and further information refer to DeviceType in the Schema Overview article.
- name: TargetDvcId
  role: target
  class: Optional
  type: String
  description: The ID of the target device. If multiple IDs are available, use the most important one, and store the others in the fields TargetDvc.
  examples:
  - ac7e9755-8eae-4ffc-8a02-50ed7a2216c3
- name: TargetDvcOs
  role: target
  class: Optional
  type: String
  description: The OS of the target device.
  examples:
  - Windows 10
- name: TargetDvcScope
  role: target
  class: Optional
  type: String
  description: The cloud platform scope the device belongs to. TargetDvcScope map to a subscription ID on Azure and to an account ID on AWS.
- name: TargetDvcScopeId
  role: target
  class: Optional
  type: String
  description: The cloud platform scope ID the device belongs to. TargetDvcScopeId map to a subscription ID on Azure and to an account ID on AWS.
- name: TargetFQDN
  role: target
  class: Optional
  type: FQDN (String)
  description: The target device hostname, including domain information when available.
  examples:
  - Contoso\DESKTOP-1282V4D
  notes: This field supports both traditional FQDN format and Windows domain\hostname format. The TargetDomainType reflects the format used.
- name: TargetGeoCity
  role: target
  class: Optional
  type: City
  description: The city associated with the target IP address.
  examples:
  - Burlington
- name: TargetGeoCountry
  role: target
  class: Optional
  type: Country
  description: The country/region associated with the target IP address.
  examples:
  - USA
- name: TargetGeoLatitude
  role: target
  class: Optional
  type: Latitude
  description: The latitude of the geographical coordinate associated with the target IP address.
  examples:
  - '44.475833'
- name: TargetGeoLongitude
  role: target
  class: Optional
  type: Longitude
  description: The longitude of the geographical coordinate associated with the target IP address.
  examples:
  - '73.211944'
- name: TargetGeoRegion
  role: target
  class: Optional
  type: Region
  description: The region associated with the target IP address.
  examples:
  - Vermont
- name: TargetIpAddr
  role: target
  class: Optional
  type: IP Address
  description: The IP address of the target device.
  examples:
  - 2.2.2.2
- name: TargetOriginalAppType
  role: target
  class: Optional
  type: String
  description: The type of the application authorizing on behalf of the Actor as reported by the reporting device.
- name: TargetOriginalRiskLevel
  role: target
  class: Optional
  type: String
  description: The risk level associated with the target, as reported by the reporting device.
  examples:
  - Suspicious
- name: TargetOriginalUserType
  role: target
  class: Optional
  type: String
  description: The user type as reported by the reporting device.
- name: TargetPortNumber
  role: target
  class: Optional
  type: Integer
  description: The port of the target device.
- name: TargetRiskLevel
  role: target
  class: Optional
  type: Integer
  description: The risk level associated with the target. The value should be adjusted to a range of 0 to 100, with 0 for benign and 100 for a high risk.
  examples:
  - '90'
- name: TargetSessionId
  role: target
  class: Optional
  type: String
  description: The sign-in session identifier of the TargetUser on the source device.
- name: TargetUrl
  role: target
  class: Optional
  type: URL
  description: The URL associated with the target application.
  examples:
  - https://console.aws.amazon.com/console/home?fromtb=true&hashArgs=%23&isauthcode=true&nc2=h_ct&src=header-signin&state=hashArgsFromTB_us-east-1_7596bc16c83d260b
- name: TargetUserId
  role: target
  class: Optional
  type: String
  description: A machine-readable, alphanumeric, unique representation of the target user. For more information, and for alternative fields for additional IDs, see The User entity.
  examples:
  - 00urjk4znu3BcncfY0h7
- name: TargetUsername
  role: target
  class: Optional
  type: Username (String)
  description: The target user username, including domain information when available. For more information, see The User entity.
  examples:
  - MarieC
- name: TargetUserScope
  role: target
  class: Optional
  type: String
  description: The scope, such as Microsoft Entra tenant, in which TargetUserId and TargetUsername are defined. or more information and list of allowed values, see UserScope in the Schema Overview article.
- name: TargetUserScopeId
  role: target
  class: Optional
  type: String
  description: The scope ID, such as Microsoft Entra Directory ID, in which TargetUserId and TargetUsername are defined. for more information and list of allowed values, see UserScopeId in the Schema Overview article.
- name: TargetUserType
  role: target
  class: Optional
  type: UserType
  description: The type of the Target user. For more information, and list of allowed values, see UserType in the Schema Overview article. For
  examples:
  - Member
- name: ThreatCategory
  role: threat
  class: Optional
  type: String
  description: The category of the threat or malware identified in audit file activity.
- name: ThreatConfidence
  role: threat
  class: Optional
  type: ConfidenceLevel (Integer)
  description: The confidence level of the threat identified, normalized to a value between 0 and a 100.
- name: ThreatFirstReportedTime
  role: threat
  class: Optional
  type: datetime
  description: The first time the IP address or domain were identified as a threat.
- name: ThreatId
  role: threat
  class: Optional
  type: String
  description: The ID of the threat or malware identified in the audit activity.
- name: ThreatIpAddr
  role: threat
  class: Optional
  type: IP Address
  description: An IP address for which a threat was identified. The field ThreatField contains the name of the field ThreatIpAddr represents.
- name: ThreatIsActive
  role: threat
  class: Optional
  type: Boolean
  description: True if the threat identified is considered an active threat.
- name: ThreatLastReportedTime
  role: threat
  class: Optional
  type: datetime
  description: The last time the IP address or domain were identified as a threat.
- name: ThreatName
  role: threat
  class: Optional
  type: String
  description: The name of the threat or malware identified in the audit activity.
- name: ThreatOriginalConfidence
  role: threat
  class: Optional
  type: String
  description: The original confidence level of the threat identified, as reported by the reporting device.
- name: ThreatOriginalRiskLevel
  role: threat
  class: Optional
  type: String
  description: The risk level as reported by the reporting device.
- name: ThreatRiskLevel
  role: threat
  class: Optional
  type: RiskLevel (Integer)
  description: The risk level associated with the identified threat. The level should be a number between 0 and 100.
  notes: The value might be provided in the source record by using a different scale, which should be normalized to this scale. The original value should be stored in ThreatRiskLevelOriginal.
- name: Application
  role: application
  class: Alias
  to:
  - TargetAppName
- name: Dst
  role: destination
  class: Alias
  type: String
  to:
  - TargetAppId
  - TargetAppName
  - TargetDvcId
  - TargetHostname
  - TargetIpAddr
  resolution: A unique identifier of the authentication target. This field may alias the TargetDvcId, TargetHostname, TargetIpAddr, TargetAppId, or TargetAppName fields.
  examples:
  - 192.168.12.1
- name: IpAddr
  role: network
  class: Alias
  to:
  - SrcIpAddr
- name: LogonTarget
  role: target
  class: Alias
  to:
  - TargetAppName
  - TargetHostname
  - TargetUrl
- name: Rule
  role: rule
  class: Alias
  type: String
  resolution: Either the value of RuleName or the value of RuleNumber. If the value of RuleNumber is used, the type should be converted to string.
- name: User
  role: user
  class: Alias
  type: Username (String)
  to:
  - TargetUserId
  - TargetUsername
  resolution: Alias to the TargetUsername or to the TargetUserId if TargetUsername is not defined.
  examples:
  - CONTOSO\dadmin
