name: ProcessEvent
title: Process Event
kind: event
version: 0.1.4
status: GA
summary: The Process Event normalization schema is used to describe the operating system activity of running and terminating a process. Such events are reported by operating systems and security systems, such as EDR (End Point Detection and Response) systems. A process, as defined by OSSEM, is a containment and management object that represents a running instance of a program. While processes themselves do not run, they do manage threads that run and execute code. For more information about normalization in Microsoft Sentinel, see Normalization and the Advanced Security Information Model (ASIM).
fields:
- name: ActingProcessId
  role: acting
  class: Mandatory
  type: String
  description: The process ID (PID) of the acting process.
  examples:
  - '48610176'
  notes: The type is defined as string to support varying systems, but on Windows and Linux this value must be numeric. If you are using a Windows or Linux machine and used a different type, make sure to convert the values. For example, if you used a hexadecimal value, convert it to a decimal value.
- name: ActorUsername
  role: actor
  class: Mandatory
  type: Username (String)
  description: The Actor username, including domain information when available. For the supported format for different ID types, refer to the User entity. Use the simple form only if domain information isn't available. Store the Username type in the ActorUsernameType field. If other username formats are available, store them in the fields ActorUsername.
  examples:
  - AlbertE
- name: Dvc
  role: device
  class: Mandatory
  description: For process activity events, device fields refer to the system on which the process was executed.
- name: EventCount
  role: common
  class: Mandatory
- name: EventEndTime
  role: common
  class: Mandatory
- name: EventProduct
  role: common
  class: Mandatory
- name: EventResult
  role: common
  class: Mandatory
- name: EventSchema
  role: common
  class: Mandatory
  type: String
  value: ProcessEvent
  description: The name of the schema documented here is ProcessEvent.
- name: EventSchemaVersion
  role: common
  class: Mandatory
  type: SchemaVersion (String)
  value: 0.1.4
  description: The version of the schema. The version of the schema documented here is 0.1.4
- name: EventStartTime
  role: common
  class: Mandatory
- name: EventType
  role: common
  class: Mandatory
  type: Enumerated
  allowed_values:
  - ProcessCreated
  - ProcessTerminated
  description: 'Describes the operation reported by the record. For Process records, supported values include: - ProcessCreated - ProcessTerminated'
- name: EventVendor
  role: common
  class: Mandatory
- name: TargetProcessCommandLine
  role: target
  class: Mandatory
  type: String
  description: The command line used to run the target process.
  examples:
  - '"choco.exe" -v'
- name: TargetProcessId
  role: target
  class: Mandatory
  type: String
  description: The process ID (PID) of the target process.
  examples:
  - '48610176'
  notes: The type is defined as string to support varying systems, but on Windows and Linux this value must be numeric. If you are using a Windows or Linux machine and used a different type, make sure to convert the values. For example, if you used a hexadecimal value, convert it to a decimal value.
- name: TargetProcessName
  role: target
  class: Mandatory
  type: string
  description: The name of the target process. This name is commonly derived from the image or executable file that's used to define the initial code and data that's mapped into the process' virtual address space.
  examples:
  - C:\Windows\explorer.exe
- name: ActorUserId
  role: actor
  class: Recommended
  type: String
  description: A machine-readable, alphanumeric, unique representation of the Actor. For the supported format for different ID types, refer to the User entity.
  examples:
  - S-1-12
- name: DvcAction
  role: device
  class: Recommended
- name: DvcDomain
  role: device
  class: Recommended
- name: DvcDomainType
  role: device
  class: Recommended
- name: DvcFQDN
  role: device
  class: Recommended
- name: DvcHostname
  role: device
  class: Recommended
- name: DvcId
  role: device
  class: Recommended
- name: DvcIdType
  role: device
  class: Recommended
- name: DvcIpAddr
  role: device
  class: Recommended
- name: EventResultDetails
  role: common
  class: Recommended
- name: EventSeverity
  role: common
  class: Recommended
- name: EventUid
  role: common
  class: Recommended
- name: ParentProcessId
  role: process
  class: Recommended
  type: String
  description: The process ID (PID) of the parent process.
  examples:
  - '48610176'
- name: TargetProcessCreationTime
  role: target
  class: Recommended
  type: DateTime
  description: The product version from the version information of the target process image file.
- name: TargetUserId
  role: target
  class: Recommended
  type: String
  description: A machine-readable, alphanumeric, unique representation of the target user. For the supported format for different ID types, refer to the User entity.
  examples:
  - S-1-12
- name: ActorUserIdType
  role: actor
  class: Conditional
  type: Enumerated
  description: The type of the ID stored in the ActorUserId field. For a list of allowed values and further information refer to UserIdType in the Schema Overview article.
- name: ActorUsernameType
  role: actor
  class: Conditional
  type: Enumerated
  description: Specifies the type of the user name stored in the ActorUsername field. For a list of allowed values and further information refer to UsernameType in the Schema Overview article.
  examples:
  - Windows
- name: HashType
  class: Conditional
  type: Enumerated
  to:
  - IMPHASH
  - MD5
  - SHA
  - SHA256
  - SHA512
  allowed_values:
  - MD5
  - SHA
  - SHA256
  - SHA512
  - IMPHASH
  description: The type of hash stored in the HASH alias field, allowed values are MD5, SHA, SHA256, SHA512 and IMPHASH.
- name: Rule
  role: rule
  class: Conditional
  type: String
  description: Either the value of kRuleName or the value of RuleNumber. If the value of RuleNumber is used, the type should be converted to string.
- name: TargetUserIdType
  role: target
  class: Conditional
  type: UserIdType
  description: The type of the ID stored in the TargetUserId field. For a list of allowed values and further information refer to UserIdType in the Schema Overview article.
- name: TargetUsernameType
  role: target
  class: Conditional
  type: Enumerated
  description: Specifies the type of the user name stored in the TargetUsername field. For a list of allowed values and further information refer to UsernameType in the Schema Overview article.
  examples:
  - Windows
- name: ActingProcessCommandLine
  role: acting
  class: Optional
  type: String
  description: The command line used to run the acting process.
  examples:
  - '"choco.exe" -v'
- name: ActingProcessCreationTime
  role: acting
  class: Optional
  type: DateTime
  description: The date and time when the acting process was started.
- name: ActingProcessFileCompany
  role: acting
  class: Optional
  type: String
  description: The company that created the acting process image file.
  examples:
  - Microsoft
- name: ActingProcessFileDescription
  role: acting
  class: Optional
  type: String
  description: The description embedded in the version information of the acting process image file.
  examples:
  - 'Notepad++ : a free (GPL) source code editor'
- name: ActingProcessFileInternalName
  role: acting
  class: Optional
  type: String
  description: The product internal file name from the version information of the acting process image file.
- name: ActingProcessFilename
  role: acting
  class: Optional
  type: String
  description: The file name part of the ActingProcessName, without folder information.
  examples:
  - explorer.exe
- name: ActingProcessFileOriginalName
  role: acting
  class: Optional
  type: String
  description: The product original file name from the version information of the acting process image file.
  examples:
  - Notepad++.exe
- name: ActingProcessFileProduct
  role: acting
  class: Optional
  type: String
  description: The product name from the version information in the acting process image file.
  examples:
  - Notepad++
- name: ActingProcessFileSize
  role: acting
  class: Optional
  type: Long
  description: The size of the file that ran the acting process.
- name: ActingProcessFileVersion
  role: acting
  class: Optional
  type: String
  description: The product version from the version information of the acting process image file.
  examples:
  - 7.9.5.0
- name: ActingProcessGuid
  role: acting
  class: Optional
  type: GUID (string)
  description: A generated unique identifier (GUID) of the acting process. Enables identifying the process across systems.
  examples:
  - EF3BD0BD-2B74-60C5-AF5C-010000001E00
- name: ActingProcessIMPHASH
  role: acting
  class: Optional
  type: String
  description: The Import Hash of all the library DLLs that are used by the acting process.
- name: ActingProcessInjectedAddress
  role: acting
  class: Optional
  type: String
  description: The memory address in which the responsible acting process is stored.
- name: ActingProcessIntegrityLevel
  role: acting
  class: Optional
  type: String
  description: 'Every process has an integrity level that is represented in its token. Integrity levels determine the process level of protection or access. Windows defines the following integrity levels: low, medium, high, and system. Standard users receive a medium integrity level and elevated users receive a high integrity level. For more information, see Mandatory Integrity Control - Win32 apps.'
- name: ActingProcessIsHidden
  role: acting
  class: Optional
  type: Boolean
  description: An indication of whether the acting process is in hidden mode.
- name: ActingProcessMD5
  role: acting
  class: Optional
  type: String
  description: The MD5 hash of the acting process image file.
  examples:
  - 75a599802f1fa166cdadb360960b1dd0
- name: ActingProcessName
  role: acting
  class: Optional
  type: string
  description: The name of the acting process. This name is commonly derived from the image or executable file that's used to define the initial code and data that's mapped into the process' virtual address space.
  examples:
  - C:\Windows\explorer.exe
- name: ActingProcessSHA1
  role: acting
  class: Optional
  type: SHA1
  description: The SHA-1 hash of the acting process image file.
  examples:
  - d55c5a4df19b46db8c54c801c4665d3338acdab0
- name: ActingProcessSHA256
  role: acting
  class: Optional
  type: SHA256
  description: The SHA-256 hash of the acting process image file. 2e1ec8cbb00b22629d2899f7c68da274
  examples:
  - e81bb824c4a09a811af17deae22f22dd
- name: ActingProcessSHA512
  role: acting
  class: Optional
  type: SHA512
  description: The SHA-512 hash of the acting process image file.
- name: ActingProcessTokenElevation
  role: acting
  class: Optional
  type: String
  description: A token indicating the presence or absence of User Access Control (UAC) privilege elevation applied to the acting process.
  examples:
  - None
- name: ActorOriginalUserType
  role: actor
  class: Optional
  type: String
  description: The original destination user type, if provided by the reporting device.
- name: ActorScope
  role: actor
  class: Optional
  type: String
  description: The scope, such as Microsoft Entra tenant, in which ActorUserId and ActorUsername are defined. or more information and list of allowed values, see UserScope in the Schema Overview article.
- name: ActorScopeId
  role: actor
  class: Optional
  type: String
  description: The scope ID, such as Microsoft Entra Directory ID, in which ActorUserId and ActorUsername are defined. or more information and list of allowed values, see UserScopeId in the Schema Overview article.
- name: ActorSessionId
  role: actor
  class: Optional
  type: String
  description: The unique ID of the login session of the Actor.
  examples:
  - '999'
  notes: The type is defined as string to support varying systems, but on Windows this value must be numeric. If you are using a Windows machine and used a different type, make sure to convert the values. For example, if you used a hexadecimal value, convert it to a decimal value.
- name: ActorUserType
  role: actor
  class: Optional
  type: UserType
  description: The type of Actor. For a list of allowed values and further information refer to UserType in the Schema Overview article.
  notes: The value might be provided in the source record by using different terms, which should be normalized to these values. Store the original value in the ActorOriginalUserType field.
- name: AdditionalFields
  role: common
  class: Optional
- name: DvcDescription
  role: device
  class: Optional
- name: DvcInterface
  role: device
  class: Optional
- name: DvcMacAddr
  role: device
  class: Optional
- name: DvcOriginalAction
  role: device
  class: Optional
- name: DvcOs
  role: device
  class: Optional
- name: DvcOsVersion
  role: device
  class: Optional
- name: DvcScope
  role: device
  class: Optional
- name: DvcScopeId
  role: device
  class: Optional
- name: DvcZone
  role: device
  class: Optional
- name: EventMessage
  role: common
  class: Optional
- name: EventOriginalResultDetails
  role: common
  class: Optional
- name: EventOriginalSeverity
  role: common
  class: Optional
- name: EventOriginalSubType
  role: common
  class: Optional
- name: EventOriginalType
  role: common
  class: Optional
- name: EventOriginalUid
  role: common
  class: Optional
- name: EventOwner
  role: common
  class: Optional
- name: EventProductVersion
  role: common
  class: Optional
- name: EventReportUrl
  role: common
  class: Optional
- name: EventSubType
  role: common
  class: Optional
- name: ParentProcessCreationTime
  role: process
  class: Optional
  type: DateTime
  description: The date and time when the parent process was started.
- name: ParentProcessFileCompany
  role: file
  class: Optional
  type: String
  description: The name of the company that created the parent process image file.
  examples:
  - Microsoft
- name: ParentProcessFileDescription
  role: file
  class: Optional
  type: String
  description: The description from the version information in the parent process image file.
  examples:
  - 'Notepad++ : a free (GPL) source code editor'
- name: ParentProcessFileProduct
  role: file
  class: Optional
  type: String
  description: The product name from the version information in parent process image file.
  examples:
  - Notepad++
- name: ParentProcessFileVersion
  role: file
  class: Optional
  type: String
  description: The product version from the version information in parent process image file.
  examples:
  - 7.9.5.0
- name: ParentProcessGuid
  role: process
  class: Optional
  type: String
  description: A generated unique identifier (GUID) of the parent process. Enables identifying the process across systems.
  examples:
  - EF3BD0BD-2B74-60C5-AF5C-010000001E00
- name: ParentProcessIMPHASH
  role: file
  class: Optional
  type: String
  description: The Import Hash of all the library DLLs that are used by the parent process.
- name: ParentProcessInjectedAddress
  role: process
  class: Optional
  type: String
  description: The memory address in which the responsible parent process is stored.
- name: ParentProcessIntegrityLevel
  role: process
  class: Optional
  type: String
  description: 'Every process has an integrity level that is represented in its token. Integrity levels determine the process level of protection or access. Windows defines the following integrity levels: low, medium, high, and system. Standard users receive a medium integrity level and elevated users receive a high integrity level. For more information, see Mandatory Integrity Control - Win32 apps.'
- name: ParentProcessIsHidden
  role: process
  class: Optional
  type: Boolean
  description: An indication of whether the parent process is in hidden mode.
- name: ParentProcessMD5
  role: file
  class: Optional
  type: MD5
  description: The MD5 hash of the parent process image file.
  examples:
  - 75a599802f1fa166cdadb360960b1dd0
- name: ParentProcessName
  role: process
  class: Optional
  type: string
  description: The name of the parent process. This name is commonly derived from the image or executable file that's used to define the initial code and data that's mapped into the process' virtual address space.
  examples:
  - C:\Windows\explorer.exe
- name: ParentProcessSHA1
  role: file
  class: Optional
  type: SHA1
  description: The SHA-1 hash of the parent process image file.
  examples:
  - d55c5a4df19b46db8c54c801c4665d3338acdab0
- name: ParentProcessSHA256
  role: file
  class: Optional
  type: SHA256
  description: The SHA-256 hash of the parent process image file. 2e1ec8cbb00b22629d2899f7c68da274
  examples:
  - e81bb824c4a09a811af17deae22f22dd
- name: ParentProcessSHA512
  role: file
  class: Optional
  type: SHA512
  description: The SHA-512 hash of the parent process image file.
- name: ParentProcessTokenElevation
  role: process
  class: Optional
  type: String
  description: A token indicating the presence or absence of User Access Control (UAC) privilege elevation applied to the parent process.
  examples:
  - None
- name: RuleName
  role: rule
  class: Optional
  type: String
  description: The name or ID of the rule by associated with the inspection results.
- name: RuleNumber
  role: rule
  class: Optional
  type: Integer
  description: The number of the rule associated with the inspection results.
- name: TargetOriginalUserType
  role: target
  class: Optional
  type: String
  description: The original destination user type, if provided by the reporting device.
- name: TargetProcessCurrentDirectory
  role: target
  class: Optional
  type: String
  description: The current directory in which the target process is executed.
  examples:
  - c:\windows\system32
- name: TargetProcessFileCompany
  role: target
  class: Optional
  type: String
  description: The name of the company that created the target process image file.
  examples:
  - Microsoft
- name: TargetProcessFileDescription
  role: target
  class: Optional
  type: String
  description: The description from the version information in the target process image file.
  examples:
  - 'Notepad++ : a free (GPL) source code editor'
- name: TargetProcessFileInternalName
  role: target
  class: Optional
  type: String
  description: The product internal file name from the version information of the image file of the target process.
- name: TargetProcessFilename
  role: target
  class: Optional
  type: String
  description: The file name part of the TargetProcessName, without folder information.
  examples:
  - explorer.exe
- name: TargetProcessFileOriginalName
  role: target
  class: Optional
  type: String
  description: The product original file name from the version information of the image file of the target process.
- name: TargetProcessFileProduct
  role: target
  class: Optional
  type: String
  description: The product name from the version information in target process image file.
  examples:
  - Notepad++
- name: TargetProcessFileSize
  role: target
  class: Optional
  type: Long
  description: Size of the file that ran the process responsible for the event.
- name: TargetProcessFileVersion
  role: target
  class: Optional
  type: String
  description: The product version from the version information in the target process image file.
  examples:
  - 7.9.5.0
- name: TargetProcessGuid
  role: target
  class: Optional
  type: GUID (String)
  description: A generated unique identifier (GUID) of the target process. Enables identifying the process across systems.
  examples:
  - EF3BD0BD-2B74-60C5-AF5C-010000001E00
- name: TargetProcessIMPHASH
  role: target
  class: Optional
  type: String
  description: The Import Hash of all the library DLLs that are used by the target process.
- name: TargetProcessInjectedAddress
  role: target
  class: Optional
  type: String
  description: The memory address in which the responsible target process is stored.
- name: TargetProcessIntegrityLevel
  role: target
  class: Optional
  type: String
  description: 'Every process has an integrity level that is represented in its token. Integrity levels determine the process level of protection or access. Windows defines the following integrity levels: low, medium, high, and system. Standard users receive a medium integrity level and elevated users receive a high integrity level. For more information, see Mandatory Integrity Control - Win32 apps.'
- name: TargetProcessIsHidden
  role: target
  class: Optional
  type: Boolean
  description: An indication of whether the target process is in hidden mode.
- name: TargetProcessMD5
  role: target
  class: Optional
  type: MD5
  description: The MD5 hash of the target process image file.
  examples:
  - 75a599802f1fa166cdadb360960b1dd0
- name: TargetProcessSHA1
  role: target
  class: Optional
  type: SHA1
  description: The SHA-1 hash of the target process image file.
  examples:
  - d55c5a4df19b46db8c54c801c4665d3338acdab0
- name: TargetProcessSHA256
  role: target
  class: Optional
  type: SHA256
  description: The SHA-256 hash of the target process image file. 2e1ec8cbb00b22629d2899f7c68da274
  examples:
  - e81bb824c4a09a811af17deae22f22dd
- name: TargetProcessSHA512
  role: target
  class: Optional
  type: SHA512
  description: The SHA-512 hash of the target process image file.
- name: TargetProcessStatusCode
  role: target
  class: Optional
  type: String
  description: The exit code returned by the target process when terminated. This field is valid only for process termination events. For consistency, the field type is string, even if value provided by the operating system is numeric.
- name: TargetProcessTokenElevation
  role: target
  class: Optional
  type: String
  description: Token type indicating the presence or absence of User Access Control (UAC) privilege elevation applied to the process that was created or terminated.
  examples:
  - None
- name: TargetUserScope
  role: target
  class: Optional
  type: String
  description: The scope, such as Microsoft Entra tenant, in which TargetUserId and TargetUsername are defined. or more information and list of allowed values, see UserScope in the Schema Overview article.
- name: TargetUserScopeId
  role: target
  class: Optional
  type: String
  description: The scope ID, such as Microsoft Entra Directory ID, in which TargetUserId and TargetUsername are defined. for more information and list of allowed values, see UserScopeId in the Schema Overview article.
- name: TargetUserSessionGuid
  role: target
  class: Optional
  type: String
  description: The unique GUID of the target user's login session, as reported by the reporting device.
  examples:
  - '{12345678-1234-1234-1234-123456789012}'
- name: TargetUserSessionId
  role: target
  class: Optional
  type: String
  description: The unique ID of the target user's login session.
  examples:
  - '999'
  notes: The type is defined as string to support varying systems, but on Windows this value must be numeric. If you are using a Windows or Linux machine and used a different type, make sure to convert the values. For example, if you used a hexadecimal value, convert it to a decimal value.
- name: TargetUserType
  role: target
  class: Optional
  type: UserType
  description: The type of Actor. For a list of allowed values and further information refer to UserType in the Schema Overview article.
  notes: The value might be provided in the source record by using different terms, which should be normalized to these values. Store the original value in the TargetOriginalUserType field.
- name: ThreatCategory
  role: threat
  class: Optional
  type: String
  description: The category of the threat or malware identified in the file activity.
  examples:
  - Trojan
- name: ThreatConfidence
  role: threat
  class: Optional
  type: ConfidenceLevel (Integer)
  description: The confidence level of the threat identified, normalized to a value between 0 and a 100.
- name: ThreatField
  role: threat
  class: Optional
  type: String
  description: The field for which a threat was identified.
- name: ThreatFirstReportedTime
  role: threat
  class: Optional
  type: datetime
  description: The first time the IP address or domain were identified as a threat.
- name: ThreatId
  role: threat
  class: Optional
  type: String
  description: The ID of the threat or malware identified in the file activity.
- name: ThreatIsActive
  role: threat
  class: Optional
  type: Boolean
  description: True if the threat identified is considered an active threat.
- name: ThreatLastReportedTime
  role: threat
  class: Optional
  type: datetime
  description: The last time the IP address or domain were identified as a threat.
- name: ThreatName
  role: threat
  class: Optional
  type: String
  description: The name of the threat or malware identified in the file activity.
  examples:
  - EICAR Test File
- name: ThreatOriginalConfidence
  role: threat
  class: Optional
  type: String
  description: The original confidence level of the threat identified, as reported by the reporting device.
- name: ThreatOriginalRiskLevel
  role: threat
  class: Optional
  type: String
  description: The risk level as reported by the reporting device.
- name: ThreatRiskLevel
  role: threat
  class: Optional
  type: RiskLevel (Integer)
  description: The risk level associated with the identified threat. The level should be a number between 0 and 100.
  notes: The value might be provided in the source record by using a different scale, which should be normalized to this scale. The original value should be stored in ThreatOriginalRiskLevel.
- name: CommandLine
  role: process
  class: Alias
  to:
  - TargetProcessCommandLine
- name: Hash
  role: file
  class: Alias
  resolution: Alias to the best available hash for the target process.
- name: Process
  role: process
  class: Alias
  to:
  - TargetProcessName
  examples:
  - C:\Windows\System32\rundll32.exe
- name: User
  role: user
  class: Alias
  to:
  - TargetUsername
  examples:
  - CONTOSO\dadmin
- name: TargetUsername
  role: target
  class: Mandatory for process create events.
  type: Username (String)
  description: The target username, including domain information when available. For the supported format for different ID types, refer to the User entity. Use the simple form only if domain information isn't available. Store the Username type in the TargetUsernameType field. If other username formats are available, store them in the fields TargetUsername.
  examples:
  - AlbertE
