name: RegistryEvent
title: Registry Event
kind: event
version: 0.1.3
status: GA
summary: The Registry Event schema is used to describe the Windows activity of creating, modifying, or deleting Windows Registry entities. Registry events are specific to Windows systems, but are reported by different systems that monitor Windows, such as EDR (End Point Detection and Response) systems, Sysmon, or Windows itself. For more information about normalization in Microsoft Sentinel, see Normalization and the Advanced Security Information Model (ASIM).
fields:
- name: ActingProcessId
  role: acting
  class: Mandatory
  type: String
  description: The process ID (PID) of the acting process.
  examples:
  - '48610176'
  notes: The type is defined as string to support varying systems, but on Windows and Linux this value must be numeric. If you are using a Windows or Linux machine and used a different type, make sure to convert the values. For example, if you used a hexadecimal value, convert it to a decimal value.
- name: ActorUsername
  role: actor
  class: Mandatory
  type: Username (String)
  description: The user name of the user who initiated the event.
  examples:
  - CONTOSO\WIN-GG82ULGC9GO$
- name: Dvc
  role: device
  class: Mandatory
  type: String
  to:
  - DvcFQDN
  - DvcHostname
  - DvcId
  - DvcIpAddr
  description: For registry activity events, device fields refer to the system on which the registry activity occurred.
- name: EventCount
  role: common
  class: Mandatory
  type: Integer
  description: The number of events described by the record. This value is used when the source supports aggregation, and a single record might represent multiple events. For other sources, set to 1.
- name: EventEndTime
  role: common
  class: Mandatory
  type: Date/time
  to:
  - TimeGenerated
  description: The time when the event ended. If the source supports aggregation and the record represents multiple events, the time that the last event was generated. If not provided by the source record, this field aliases the TimeGenerated field.
- name: EventProduct
  role: common
  class: Mandatory
  type: String
  description: The product generating the event. The value should be one of the values listed in Vendors and Products.
  examples:
  - Sysmon
- name: EventResult
  role: common
  class: Mandatory
  type: Enumerated
  description: 'One of the following values: Success, Partial, Failure, NA (Not Applicable). The value might be provided in the source record by using different terms, which should be normalized to these values. Alternatively, the source might provide only the EventResultDetails field, which should be analyzed to derive the EventResult value.'
  examples:
  - Success
- name: EventSchema
  role: common
  class: Mandatory
  type: String
  value: RegistryEvent
  description: The name of the schema documented here is RegistryEvent.
- name: EventSchemaVersion
  role: common
  class: Mandatory
  type: SchemaVersion (String)
  value: 0.1.3
  description: The version of the schema. The version of the schema documented here is 0.1.3
- name: EventStartTime
  role: common
  class: Mandatory
  type: Date/time
  to:
  - TimeGenerated
  description: The time when the event started. If the source supports aggregation and the record represents multiple events, the time that the first event was generated. If not provided by the source record, this field aliases the TimeGenerated field.
- name: EventType
  role: common
  class: Mandatory
  type: Enumerated
  allowed_values:
  - RegistryKeyCreated
  - RegistryKeyDeleted
  - RegistryKeyRenamed
  - RegistryValueDeleted
  - RegistryValueSet
  description: 'Describes the operation reported by the record. For Registry records, supported values include: - RegistryKeyCreated - RegistryKeyDeleted - RegistryKeyRenamed - RegistryValueDeleted - RegistryValueSet'
- name: EventVendor
  role: common
  class: Mandatory
  type: String
  description: The vendor of the product generating the event. The value should be one of the values listed in Vendors and Products.
  examples:
  - Microsoft
- name: ParentProcessId
  role: process
  class: Mandatory
  type: String
  description: The process ID (PID) of the parent process.
  examples:
  - '48610176'
- name: RegistryKey
  role: registry
  class: Mandatory
  type: String
  description: The registry key associated with the operation, normalized to standard root key naming conventions. For more information, see Root Keys. Registry keys are similar to folders in file systems.
  examples:
  - HKEY_LOCAL_MACHINE\SOFTWARE\MTG
- name: ActorUserId
  role: actor
  class: Recommended
  type: String
  description: A unique ID of the Actor. The specific ID depends on the system generating the event. For more information, see The User entity.
  examples:
  - S-1-5-18
- name: DvcAction
  role: device
  class: Recommended
  type: String
  description: For reporting security systems, the action taken by the system, if applicable.
  examples:
  - Blocked
- name: DvcDomain
  role: device
  class: Recommended
  type: Domain (String)
  description: The domain of the device on which the event occurred or which reported the event, depending on the schema.
  examples:
  - Contoso
- name: DvcDomainType
  role: device
  class: Recommended
  type: Enumerated
  required_if:
  - the DvcDomain field is used
  description: The type of DvcDomain. For a list of allowed values and further information, refer to DomainType.
  notes: This field is required if the DvcDomain field is used.
- name: DvcFQDN
  role: device
  class: Recommended
  type: FQDN (String)
  description: The hostname of the device on which the event occurred or which reported the event, depending on the schema.
  examples:
  - Contoso\DESKTOP-1282V4D
  notes: This field supports both traditional FQDN format and Windows domain\hostname format. The DvcDomainType field reflects the format used.
- name: DvcHostname
  role: device
  class: Recommended
  type: Hostname
  description: The hostname of the device on which the event occurred or which reported the event, depending on the schema.
  examples:
  - ContosoDc
- name: DvcId
  role: device
  class: Recommended
  type: String
  description: The unique ID of the device on which the event occurred or which reported the event, depending on the schema. If multiple IDs are available, use the first one from the list, and store the others by using the field names DvcAzureResourceId, DvcMDEid, etc.
  examples:
  - 41502da5-21b7-48ec-81c9-baeea8d7d669
- name: DvcIdType
  role: device
  class: Recommended
  type: Enumerated
  required_if:
  - the DvcId field is used
  allowed_values:
  - AzureResourceId
  - MDEid
  - MD4IoTid
  - VMConnectionId
  - AwsVpcId
  - VectraId
  - AppGateId
  - FQDN
  - Other
  description: The type of DvcId. The list of allowed values is AzureResourceId, MDEid, MD4IoTid, VMConnectionId, AwsVpcId, VectraId, AppGateId, FQDN, and Other. Using FQDN as a device ID, implies reusing the hostname. Use it only as a last resort.
  notes: This field is required if the DvcId field is used.
- name: DvcIpAddr
  role: device
  class: Recommended
  type: IP address
  description: The IP address of the device on which the event occurred or which reported the event, depending on the schema.
  examples:
  - 45.21.42.12
- name: EventResultDetails
  role: common
  class: Recommended
  type: Enumerated
  description: Reason or details for the result reported in the EventResult field. Each schema documents the list of values valid for this field. The original, source specific, value is stored in the EventOriginalResultDetails field.
  examples:
  - NXDOMAIN
- name: EventSeverity
  role: common
  class: Recommended
  type: Enumerated
  description: 'The severity of the event. Valid values are: Informational, Low, Medium, or High.'
- name: EventUid
  role: common
  class: Recommended
  type: String
  description: The unique ID of the record, as assigned by Microsoft Sentinel. This field is typically mapped to the _ItemId Log Analytics field.
- name: RegistryPreviousKey
  role: registry
  class: Recommended
  type: String
  description: For operations that modify the registry, the original registry key, normalized to standard root key naming. For more information, see Root Keys.
  examples:
  - HKEY_LOCAL_MACHINE\SOFTWARE\MTG
  notes: If the operation changed other fields, such as the value, but the key remains the same, the RegistryPreviousKey will have the same value as RegistryKey.
- name: RegistryPreviousValue
  role: registry
  class: Recommended
  type: String
  description: For operations that modify the registry, the original value type, normalized to the standard form. For more information, see Value Types. If the type was not changed, this field has the same value as the RegistryValueType field.
  examples:
  - Path
- name: RegistryPreviousValueData
  role: registry
  class: Recommended
  type: String
  description: The original registry data, for operations that modify the registry.
  examples:
  - C:\Windows\system32;C:\Windows;
- name: RegistryPreviousValueType
  role: registry
  class: Recommended
  type: String
  description: For operations that modify the registry, the original value type. If the type was not changed, this field will have the same value as the RegistryValueType field, normalized to the standard form. For more information, see Value types.
  examples:
  - Reg_Expand_Sz
- name: RegistryValue
  role: registry
  class: Recommended
  type: String
  description: The registry value associated with the operation. Registry values are similar to files in file systems.
  examples:
  - Path
- name: RegistryValueData
  role: registry
  class: Recommended
  type: String
  description: The data stored in the registry value.
  examples:
  - C:\Windows\system32;C:\Windows;
- name: RegistryValueType
  role: registry
  class: Recommended
  type: String
  description: The type of registry value, normalized to standard form. For more information, see Value Types.
  examples:
  - Reg_Expand_Sz
- name: ActorUserIdType
  role: actor
  class: Conditional
  type: Enumerated
  description: The type of the ID stored in the ActorUserId field. For more information, see The User entity.
  examples:
  - SID
- name: ActorUsernameType
  role: actor
  class: Conditional
  type: Enumerated
  description: Specifies the type of the user name stored in the ActorUsername field. For more information, see The User entity.
  examples:
  - Windows
- name: Rule
  role: rule
  class: Conditional
  type: String
  description: Either the value of kRuleName or the value of RuleNumber. If the value of RuleNumber is used, the type should be converted to string.
- name: ActingProcessGuid
  role: acting
  class: Optional
  type: GUID (String)
  description: A generated unique identifier (GUID) of the acting process.
  examples:
  - EF3BD0BD-2B74-60C5-AF5C-010000001E00
  - 01234567-89AB-CDEF-0123-456789ABCDEF
- name: ActingProcessName
  role: acting
  class: Optional
  type: String
  description: The file name of the acting process image file. This name is typically considered to be the process name.
  examples:
  - C:\Windows\explorer.exe
- name: ActorScope
  role: actor
  class: Optional
  type: String
  description: The scope, such as Microsoft Entra tenant, in which ActorUserId and ActorUsername are defined. or more information and list of allowed values, see UserScope in the Schema Overview article.
- name: ActorSessionId
  role: actor
  class: Optional
  type: String
  description: The unique ID of the login session of the Actor.
  examples:
  - '999'
  notes: The type is defined as string to support varying systems, but on Windows this value must be numeric. If you are using a Windows machine and the source sends a different type, make sure to convert the value. For example, if source sends a hexadecimal value, convert it to a decimal value.
- name: AdditionalFields
  role: common
  class: Optional
  type: Dynamic
  description: If your source provides additional information worth preserving, either keep it with the original field names or create the dynamic AdditionalFields field, and add the extra information as key/value pairs.
- name: DvcDescription
  role: device
  class: Optional
  type: String
  description: A descriptive text associated with the device.
  examples:
  - Primary Domain Controller
- name: DvcInterface
  role: device
  class: Optional
  type: String
  description: The network interface on which data was captured. This field is typically relevant to network related activity, which is captured by an intermediate or tap device.
- name: DvcMacAddr
  role: device
  class: Optional
  type: MAC address
  description: The MAC address of the device on which the event occurred or which reported the event.
  examples:
  - 00:1B:44:11:3A:B7
- name: DvcOriginalAction
  role: device
  class: Optional
  type: String
  description: The original DvcAction as provided by the reporting device.
- name: DvcOs
  role: device
  class: Optional
  type: String
  description: The operating system running on the device on which the event occurred or which reported the event.
  examples:
  - Windows
- name: DvcOsVersion
  role: device
  class: Optional
  type: String
  description: The version of the operating system on the device on which the event occurred or which reported the event.
  examples:
  - '10'
- name: DvcScope
  role: device
  class: Optional
  type: String
  description: The cloud platform scope the device belongs to. DvcScope map to a subscription ID on Azure and to an account ID on AWS.
- name: DvcScopeId
  role: device
  class: Optional
  type: String
  description: The cloud platform scope ID the device belongs to. DvcScopeId map to a subscription ID on Azure and to an account ID on AWS.
- name: DvcZone
  role: device
  class: Optional
  type: String
  description: The network on which the event occurred or which reported the event, depending on the schema. The zone is defined by the reporting device.
  examples:
  - Dmz
- name: EventMessage
  role: common
  class: Optional
  type: String
  description: A general message or description, either included in or generated from the record.
- name: EventOriginalResultDetails
  role: common
  class: Optional
  type: String
  description: The original result details provided by the source. This value is used to derive EventResultDetails, which should have only one of the values documented for each schema.
- name: EventOriginalSeverity
  role: common
  class: Optional
  type: String
  description: The original severity as provided by the reporting device. This value is used to derive EventSeverity.
- name: EventOriginalSubType
  role: common
  class: Optional
  type: String
  description: The original event subtype or ID, if provided by the source. For example, this field is used to store the original Windows logon type. This value is used to derive EventSubType, which should have only one of the values documented for each schema.
  examples:
  - '2'
- name: EventOriginalType
  role: common
  class: Optional
  type: String
  description: The original event type or ID, if provided by the source. For example, this field is used to store the original Windows event ID. This value is used to derive EventType, which should have only one of the values documented for each schema.
  examples:
  - '4624'
- name: EventOriginalUid
  role: common
  class: Optional
  type: String
  description: A unique ID of the original record, if provided by the source.
  examples:
  - 69f37748-ddcd-4331-bf0f-b137f1ea83b
- name: EventOwner
  role: common
  class: Optional
  type: String
  description: The owner of the event, which is usually the department or subsidiary in which it was generated.
- name: EventProductVersion
  role: common
  class: Optional
  type: String
  description: The version of the product generating the event.
  examples:
  - '12.1'
- name: EventReportUrl
  role: common
  class: Optional
  type: URL (String)
  description: A URL provided in the event for a resource that provides more information about the event.
- name: EventSubType
  role: common
  class: Optional
  type: Enumerated
  description: Describes a subdivision of the operation reported in the EventType field. Each schema documents the list of values valid for this field. The original, source specific, value is stored in the EventOriginalSubType field.
- name: ParentProcessGuid
  role: process
  class: Optional
  type: String
  description: A generated unique identifier (GUID) of the parent process.
  examples:
  - EF3BD0BD-2B74-60C5-AF5C-010000001E00
- name: ParentProcessName
  role: process
  class: Optional
  type: String
  description: The file name of the parent process image file. This value is typically considered to be the process name.
  examples:
  - C:\Windows\explorer.exe
- name: RuleName
  role: rule
  class: Optional
  type: String
  description: The name or ID of the rule by associated with the inspection results.
- name: RuleNumber
  role: rule
  class: Optional
  type: Integer
  description: The number of the rule associated with the inspection results.
- name: ThreatCategory
  role: threat
  class: Optional
  type: String
  description: The category of the threat or malware identified in the file activity.
  examples:
  - Trojan
- name: ThreatConfidence
  role: threat
  class: Optional
  type: ConfidenceLevel (Integer)
  description: The confidence level of the threat identified, normalized to a value between 0 and a 100.
- name: ThreatField
  role: threat
  class: Optional
  type: String
  description: The field for which a threat was identified.
- name: ThreatFirstReportedTime
  role: threat
  class: Optional
  type: datetime
  description: The first time the IP address or domain were identified as a threat.
- name: ThreatId
  role: threat
  class: Optional
  type: String
  description: The ID of the threat or malware identified in the file activity.
- name: ThreatIsActive
  role: threat
  class: Optional
  type: Boolean
  description: True if the threat identified is considered an active threat.
- name: ThreatLastReportedTime
  role: threat
  class: Optional
  type: datetime
  description: The last time the IP address or domain were identified as a threat.
- name: ThreatName
  role: threat
  class: Optional
  type: String
  description: The name of the threat or malware identified in the file activity.
  examples:
  - EICAR Test File
- name: ThreatOriginalConfidence
  role: threat
  class: Optional
  type: String
  description: The original confidence level of the threat identified, as reported by the reporting device.
- name: ThreatOriginalRiskLevel
  role: threat
  class: Optional
  type: String
  description: The risk level as reported by the reporting device.
- name: ThreatRiskLevel
  role: threat
  class: Optional
  type: RiskLevel (Integer)
  description: The risk level associated with the identified threat. The level should be a number between 0 and 100.
  notes: The value might be provided in the source record by using a different scale, which should be normalized to this scale. The original value should be stored in ThreatOriginalRiskLevel.
- name: Process
  role: process
  class: Alias
  to:
  - ActingProcessName
  - ProcessName
  examples:
  - C:\Windows\System32\rundll32.exe
- name: User
  role: user
  class: Alias
  to:
  - ActorUsername
  examples:
  - CONTOSO\ dadmin
