name: WebSession
title: Web Session
kind: event
version: 0.2.7
status: GA
summary: The Web Session normalization schema is used to describe an IP network activity. For example, IP network activities are reported by web servers, web proxies, and web security gateways. For more information about normalization in Microsoft Sentinel, see Normalization and the Advanced Security Information Model (ASIM).
fields:
- name: Dvc
  role: device
  class: Mandatory
  description: For Web Session events, device fields refer to the system reporting the Web Session event. This is typically an intermediary device for HTTPSession events, and the destination web or application server for WebServerSession and ApiRequest events.
- name: EventCount
  role: common
  class: Mandatory
- name: EventEndTime
  role: common
  class: Mandatory
- name: EventProduct
  role: common
  class: Mandatory
- name: EventResult
  role: common
  class: Mandatory
  type: Enumerated
  description: 'Describes the event result, normalized to one of the following values: - Success - Partial - Failure - NA (not applicable) For an HTTP session, Success is defined as a status code lower than 400, and Failure is defined as a status code higher than 400. For a list of HTTP status codes, refer to W3 Org. The source may provide only a value for the EventResultDetails field, which must be analyzed to get the EventResult value.'
- name: EventSchema
  role: common
  class: Mandatory
  type: Enumerated
  value: WebSession
  description: The name of the schema documented here is WebSession.
- name: EventSchemaVersion
  role: common
  class: Mandatory
  type: SchemaVersion (String)
  value: 0.2.7
  description: The version of the schema. The version of the schema documented here is 0.2.7
- name: EventStartTime
  role: common
  class: Mandatory
- name: EventType
  role: common
  class: Mandatory
  type: Enumerated
  allowed_values:
  - HTTPsession
  - WebServerSession
  - ApiRequest
  description: 'Describes the operation reported by the record. Allowed values are: - HTTPsession: Denotes a network session used for HTTP or HTTPS, typically reported by an intermediary device, such as a proxy or a Web security gateway. - WebServerSession: Denotes an HTTP request reported by a web server. Such an event typically has less network related information. The URL reported should not include a schema and a server name, but only the path and parameters part of the URL. - ApiRequest: Denotes an HTTP request reported associated with an API call, typically reported by an application server. Such an event typically has less network related information. When reported by the application server, the URL reported should not include a schema and a server name, but only the path and parameters part of the URL.'
- name: EventVendor
  role: common
  class: Mandatory
- name: Url
  role: web
  class: Mandatory
  type: URL (String)
  description: The HTTP request URL, including parameters. For HTTPSession events, the URL may include the schema and should include the server name. For WebServerSession and for ApiRequest the URL would typically not include the schema and server, which can be found in the NetworkApplicationProtocol and DstFQDN fields respectively.
  examples:
  - https://contoso.com/fo/?k=v&q=u#f
- name: DvcAction
  role: device
  class: Recommended
- name: DvcDomain
  role: device
  class: Recommended
- name: DvcDomainType
  role: device
  class: Recommended
- name: DvcFQDN
  role: device
  class: Recommended
- name: DvcHostname
  role: device
  class: Recommended
- name: DvcId
  role: device
  class: Recommended
- name: DvcIdType
  role: device
  class: Recommended
- name: DvcIpAddr
  role: device
  class: Recommended
- name: EventResultDetails
  role: common
  class: Recommended
  type: Enumerated
  description: The HTTP status code as defined by The World Wide Web Consortium
  notes: The value may be provided in the source record using different terms, which should be normalized to these values. The original value should be stored in the EventOriginalResultDetails field.
- name: EventSeverity
  role: common
  class: Recommended
- name: EventUid
  role: common
  class: Recommended
- name: HttpRequestMethod
  role: http
  class: Recommended
  type: Enumerated
  description: The HTTP Method. The values are as defined in RFC 7231 and RFC 5789, and include GET, HEAD, POST, PUT, DELETE, CONNECT, OPTIONS, TRACE, and PATCH.
  examples:
  - GET
- name: HashType
  class: Conditional
  type: Enumerated
  allowed_values:
  - MD5
  - SHA1
  - SHA256
  - SHA512
  description: 'The type of the hash in the Hash field. Possible values include: MD5, SHA1, SHA256, and SHA512.'
- name: AdditionalFields
  role: common
  class: Optional
- name: DvcDescription
  role: device
  class: Optional
- name: DvcInterface
  role: device
  class: Optional
- name: DvcMacAddr
  role: device
  class: Optional
- name: DvcOriginalAction
  role: device
  class: Optional
- name: DvcOs
  role: device
  class: Optional
- name: DvcOsVersion
  role: device
  class: Optional
- name: DvcScope
  role: device
  class: Optional
- name: DvcScopeId
  role: device
  class: Optional
- name: DvcZone
  role: device
  class: Optional
- name: EventMessage
  role: common
  class: Optional
- name: EventOriginalResultDetails
  role: common
  class: Optional
- name: EventOriginalSeverity
  role: common
  class: Optional
- name: EventOriginalSubType
  role: common
  class: Optional
- name: EventOriginalType
  role: common
  class: Optional
- name: EventOriginalUid
  role: common
  class: Optional
- name: EventOwner
  role: common
  class: Optional
- name: EventProductVersion
  role: common
  class: Optional
- name: EventReportUrl
  role: common
  class: Optional
- name: EventSubType
  role: common
  class: Optional
- name: FileContentType
  role: file
  class: Optional
  type: String
  description: For HTTP uploads, the content type of the uploaded file.
- name: FileMD5
  role: file
  class: Optional
  type: MD5
  description: For HTTP uploads, the MD5 hash of the uploaded file.
  examples:
  - 75a599802f1fa166cdadb360960b1dd0
- name: FileName
  role: file
  class: Optional
  type: String
  description: For HTTP uploads, the name of the uploaded file.
- name: FileSHA1
  role: file
  class: Optional
  type: SHA1
  description: For HTTP uploads, the SHA1 hash of the uploaded file. c801c4665d3338acdab0
  examples:
  - d55c5a4df19b46db8c54
- name: FileSHA256
  role: file
  class: Optional
  type: SHA256
  description: For HTTP uploads, the SHA256 hash of the uploaded file. 2e1ec8cbb00b22629d2899f7c68da274
  examples:
  - e81bb824c4a09a811af17deae22f22dd
- name: FileSHA512
  role: file
  class: Optional
  type: SHA512
  description: For HTTP uploads, the SHA512 hash of the uploaded file.
- name: FileSize
  role: file
  class: Optional
  type: Long
  description: For HTTP uploads, the size in bytes of the uploaded file.
- name: HttpContentFormat
  role: http
  class: Optional
  type: String
  description: The content format part of the HttpContentType
  examples:
  - text/html
- name: HttpContentType
  role: http
  class: Optional
  type: String
  description: The HTTP Response content type header.
  examples:
  - text/html; charset=ISO-8859-4
  notes: The HttpContentType field may include both the content format and extra parameters, such as the encoding used to get the actual format.
- name: HttpCookie
  role: http
  class: Optional
  type: String
  description: The content of the HTTP cookie header sent from the client to the server, containing name-value pairs of session data.
  examples:
  - session_id=abc123; user_pref=dark_mode
- name: HttpHost
  role: http
  class: Optional
  type: String
  description: The virtual web server the HTTP request has targeted. This value is typically based on the HTTP Host header.
- name: HttpIsProxied
  role: http
  class: Optional
  type: Boolean
  description: Indicates whether the HTTP request was sent through a proxy server.
  examples:
  - 'true'
- name: HttpReferrer
  role: http
  class: Optional
  type: String
  description: The HTTP referrer header.
  examples:
  - https://developer.mozilla.org/docs
  notes: ASIM, in sync with OSSEM, uses the correct spelling for referrer, and not the original HTTP header spelling.
- name: HttpRequestBodyBytes
  role: http
  class: Optional
  type: Long
  description: The size of the HTTP request body in bytes, not including headers.
  examples:
  - '1024'
- name: HttpRequestCacheControl
  role: http
  class: Optional
  type: String
  description: The content of the HTTP Cache-Control request header, specifying caching directives from the client.
  examples:
  - no-cache
- name: HttpRequestHeaderCount
  role: http
  class: Optional
  type: Integer
  description: The number of HTTP headers included in the request.
  examples:
  - '12'
- name: HttpRequestTime
  role: http
  class: Optional
  type: Integer
  description: The amount of time, in milliseconds, it took to send the request to the server, if applicable.
  examples:
  - '700'
- name: HttpRequestXff
  role: http
  class: Optional
  type: IP Address
  description: The HTTP X-Forwarded-For header.
  examples:
  - 120.12.41.1
- name: HttpResponseBodyBytes
  role: http
  class: Optional
  type: Long
  description: The size of the HTTP response body in bytes, not including headers.
  examples:
  - '8192'
- name: HttpResponseCacheControl
  role: http
  class: Optional
  type: String
  description: The content of the HTTP Cache-Control response header, specifying caching directives from the server.
  examples:
  - max-age=3600, public
- name: HttpResponseExpires
  role: http
  class: Optional
  type: String
  description: The content of the HTTP Expires response header, indicating when the response content expires.
  examples:
  - Thu, 01 Dec 2024 16:00:00 GMT
- name: HttpResponseHeaderCount
  role: http
  class: Optional
  type: Integer
  description: The number of HTTP headers included in the response.
  examples:
  - '15'
- name: HttpResponseTime
  role: http
  class: Optional
  type: Integer
  description: The amount of time, in milliseconds, it took to receive a response in the server, if applicable.
  examples:
  - '800'
- name: HttpUserAgent
  role: http
  class: Optional
  type: String
  description: The HTTP user agent header. AppleWebKit/537.36 (KHTML, like Gecko) Chrome/83.0.4103.97 Safari/537.36
  examples:
  - Mozilla/5.0
- name: HttpVersion
  role: http
  class: Optional
  type: String
  description: The HTTP Request Version.
  examples:
  - '2.0'
- name: UrlCategory
  role: web
  class: Optional
  type: String
  description: The defined grouping of a URL or the domain part of the URL. The category is commonly provided by web security gateways and is based on the content of the site the URL points to.
  examples:
  - search engines, adult, news, advertising, and parked domains.
- name: UrlOriginal
  role: web
  class: Optional
  type: URL (String)
  description: The original value of the URL, when the URL was modified by the reporting device and both values are provided.
- name: Hash
  role: file
  class: Alias
  resolution: Alias to the available Hash field.
- name: HttpStatusCode
  role: http
  class: Alias
  to:
  - EventResultDetails
  resolution: The HTTP Status Code. Alias to EventResultDetails.
- name: UserAgent
  role: user
  class: Alias
  to:
  - HttpUserAgent
