AADTenantId: fields/aad_tenant_id.yaml
ActingAppId: fields/acting_app_id.yaml
ActingAppName: fields/acting_app_name.yaml
ActingAppType: fields/acting_app_type.yaml
ActingOriginalAppType: fields/acting_original_app_type.yaml
ActingProcessCommandLine: fields/acting_process_command_line.yaml
ActingProcessCreationTime: fields/acting_process_creation_time.yaml
ActingProcessFileCompany: fields/acting_process_file_company.yaml
ActingProcessFileDescription: fields/acting_process_file_description.yaml
ActingProcessFileInternalName: fields/acting_process_file_internal_name.yaml
ActingProcessFilename: fields/acting_process_filename.yaml
ActingProcessFileOriginalName: fields/acting_process_file_original_name.yaml
ActingProcessFileProduct: fields/acting_process_file_product.yaml
ActingProcessFileSize: fields/acting_process_file_size.yaml
ActingProcessFileVersion: fields/acting_process_file_version.yaml
ActingProcessGuid: fields/acting_process_guid.yaml
ActingProcessId: fields/acting_process_id.yaml
ActingProcessIMPHASH: fields/acting_process_imphash.yaml
ActingProcessInjectedAddress: fields/acting_process_injected_address.yaml
ActingProcessIntegrityLevel: fields/acting_process_integrity_level.yaml
ActingProcessIsHidden: fields/acting_process_is_hidden.yaml
ActingProcessMD5: fields/acting_process_md5.yaml
ActingProcessName: fields/acting_process_name.yaml
ActingProcessSHA1: fields/acting_process_sha1.yaml
ActingProcessSHA256: fields/acting_process_sha256.yaml
ActingProcessSHA512: fields/acting_process_sha512.yaml
ActingProcessTokenElevation: fields/acting_process_token_elevation.yaml
ActorOriginalUserType: fields/actor_original_user_type.yaml
ActorScope: fields/actor_scope.yaml
ActorScopeId: fields/actor_scope_id.yaml
ActorSessionId: fields/actor_session_id.yaml
ActorUserId: fields/actor_user_id.yaml
ActorUserIdType: fields/actor_user_id_type.yaml
ActorUsername: fields/actor_username.yaml
ActorUsernameType: fields/actor_username_type.yaml
ActorUserScope: fields/actor_user_scope.yaml
ActorUserScopeId: fields/actor_user_scope_id.yaml
ActorUserType: fields/actor_user_type.yaml
AdditionalAssetOwners: fields/additional_asset_owners.yaml
AdditionalFields: fields/additional_fields.yaml
AlertDescription: fields/alert_description.yaml
AlertId: fields/alert_id.yaml
AlertName: fields/alert_name.yaml
AlertOriginalStatus: fields/alert_original_status.yaml
AlertStatus: fields/alert_status.yaml
AlertVerdict: fields/alert_verdict.yaml
Application: fields/application.yaml
ASimMatchingHostname: fields/asim_matching_hostname.yaml
ASimMatchingIpAddr: fields/asim_matching_ip_addr.yaml
AssetClassificationLastScanDateTime: fields/asset_classification_last_scan_date_time.yaml
AssetIsProtectedByDlp: fields/asset_is_protected_by_dlp.yaml
AssetOriginalDataClassificationType: fields/asset_original_data_classification_type.yaml
AssetOriginalPermissions: fields/asset_original_permissions.yaml
AssetOriginalRiskDetails: fields/asset_original_risk_details.yaml
AssetOriginalRiskLevel: fields/asset_original_risk_level.yaml
AssetOriginalSensitivityLevel: fields/asset_original_sensitivity_level.yaml
AssetOriginalType: fields/asset_original_type.yaml
AssetOwnerId: fields/asset_owner_id.yaml
AssetOwnerIdType: fields/asset_owner_id_type.yaml
AssetOwnerScope: fields/asset_owner_scope.yaml
AssetOwnerScopeId: fields/asset_owner_scope_id.yaml
AssetOwnerType: fields/asset_owner_type.yaml
AssetPath: fields/asset_path.yaml
AssetRelatedIndicators: fields/asset_related_indicators.yaml
AssetRiskFirstReportedTime: fields/asset_risk_first_reported_time.yaml
AssetRiskLastReportedTime: fields/asset_risk_last_reported_time.yaml
AssetRiskLevel: fields/asset_risk_level.yaml
AssetRiskName: fields/asset_risk_name.yaml
AssetSensitivityLabel: fields/asset_sensitivity_label.yaml
AssetType: fields/asset_type.yaml
AttackRemediationSteps: fields/attack_remediation_steps.yaml
AttackTactics: fields/attack_tactics.yaml
AttackTechniques: fields/attack_techniques.yaml
CommandLine: fields/command_line.yaml
DetectionMethod: fields/detection_method.yaml
DhcpCircuitId: fields/dhcp_circuit_id.yaml
DhcpLeaseDuration: fields/dhcp_lease_duration.yaml
DhcpSessionDuration: fields/dhcp_session_duration.yaml
DhcpSessionId: fields/dhcp_session_id.yaml
DhcpSrcDHCId: fields/dhcp_src_dhc_id.yaml
DhcpSubscriberId: fields/dhcp_subscriber_id.yaml
DhcpUserClass: fields/dhcp_user_class.yaml
DhcpUserClassId: fields/dhcp_user_class_id.yaml
DhcpVendorClass: fields/dhcp_vendor_class.yaml
DhcpVendorClassId: fields/dhcp_vendor_class_id.yaml
DnsFlags: fields/dns_flags.yaml
DnsFlagsAuthenticated: fields/dns_flags_authenticated.yaml
DnsFlagsAuthoritative: fields/dns_flags_authoritative.yaml
DnsFlagsCheckingDisabled: fields/dns_flags_checking_disabled.yaml
DnsFlagsRecursionAvailable: fields/dns_flags_recursion_available.yaml
DnsFlagsRecursionDesired: fields/dns_flags_recursion_desired.yaml
DnsFlagsTruncated: fields/dns_flags_truncated.yaml
DnsFlagsZ: fields/dns_flags_z.yaml
DnsNetworkDuration: fields/dns_network_duration.yaml
DnsQuery: fields/dns_query.yaml
DnsQueryClass: fields/dns_query_class.yaml
DnsQueryClassName: fields/dns_query_class_name.yaml
DnsQueryType: fields/dns_query_type.yaml
DnsQueryTypeName: fields/dns_query_type_name.yaml
DnsResponseCode: fields/dns_response_code.yaml
DnsResponseCodeName: fields/dns_response_code_name.yaml
DnsResponseIpCity: fields/dns_response_ip_city.yaml
DnsResponseIpCountry: fields/dns_response_ip_country.yaml
DnsResponseIpLatitude: fields/dns_response_ip_latitude.yaml
DnsResponseIpLongitude: fields/dns_response_ip_longitude.yaml
DnsResponseIpRegion: fields/dns_response_ip_region.yaml
DnsResponseName: fields/dns_response_name.yaml
DnsSessionId: fields/dns_session_id.yaml
Domain: fields/domain.yaml
DomainCategory: fields/domain_category.yaml
Dst: fields/dst.yaml
DstAppId: fields/dst_app_id.yaml
DstAppName: fields/dst_app_name.yaml
DstAppType: fields/dst_app_type.yaml
DstBytes: fields/dst_bytes.yaml
DstDescription: fields/dst_description.yaml
DstDeviceType: fields/dst_device_type.yaml
DstDomain: fields/dst_domain.yaml
DstDomainType: fields/dst_domain_type.yaml
DstDvcId: fields/dst_dvc_id.yaml
DstDvcIdType: fields/dst_dvc_id_type.yaml
DstDvcScope: fields/dst_dvc_scope.yaml
DstDvcScopeId: fields/dst_dvc_scope_id.yaml
DstFQDN: fields/dst_fqdn.yaml
DstGeoCity: fields/dst_geo_city.yaml
DstGeoCountry: fields/dst_geo_country.yaml
DstGeoLatitude: fields/dst_geo_latitude.yaml
DstGeoLongitude: fields/dst_geo_longitude.yaml
DstGeoRegion: fields/dst_geo_region.yaml
DstHostname: fields/dst_hostname.yaml
DstInterfaceGuid: fields/dst_interface_guid.yaml
DstInterfaceName: fields/dst_interface_name.yaml
DstIpAddr: fields/dst_ip_addr.yaml
DstMacAddr: fields/dst_mac_addr.yaml
DstNatIpAddr: fields/dst_nat_ip_addr.yaml
DstNatPortNumber: fields/dst_nat_port_number.yaml
DstOriginalRiskLevel: fields/dst_original_risk_level.yaml
DstOriginalUserType: fields/dst_original_user_type.yaml
DstPackets: fields/dst_packets.yaml
DstPortNumber: fields/dst_port_number.yaml
DstProcessGuid: fields/dst_process_guid.yaml
DstProcessId: fields/dst_process_id.yaml
DstProcessName: fields/dst_process_name.yaml
DstRiskLevel: fields/dst_risk_level.yaml
DstUserId: fields/dst_user_id.yaml
DstUserIdType: fields/dst_user_id_type.yaml
DstUsername: fields/dst_username.yaml
DstUsernameType: fields/dst_username_type.yaml
DstUserScope: fields/dst_user_scope.yaml
DstUserScopeId: fields/dst_user_scope_id.yaml
DstUserType: fields/dst_user_type.yaml
DstVlanId: fields/dst_vlan_id.yaml
DstZone: fields/dst_zone.yaml
Duration: fields/duration.yaml
Dvc: fields/dvc.yaml
DvcAction: fields/dvc_action.yaml
DvcDescription: fields/dvc_description.yaml
DvcDomain: fields/dvc_domain.yaml
DvcDomainType: fields/dvc_domain_type.yaml
DvcFQDN: fields/dvc_fqdn.yaml
DvcHostname: fields/dvc_hostname.yaml
DvcId: fields/dvc_id.yaml
DvcIdType: fields/dvc_id_type.yaml
DvcInboundInterface: fields/dvc_inbound_interface.yaml
DvcInterface: fields/dvc_interface.yaml
DvcIpAddr: fields/dvc_ip_addr.yaml
DvcMacAddr: fields/dvc_mac_addr.yaml
DvcOriginalAction: fields/dvc_original_action.yaml
DvcOs: fields/dvc_os.yaml
DvcOsVersion: fields/dvc_os_version.yaml
DvcOutboundInterface: fields/dvc_outbound_interface.yaml
DvcScope: fields/dvc_scope.yaml
DvcScopeId: fields/dvc_scope_id.yaml
DvcZone: fields/dvc_zone.yaml
EmailMessageId: fields/email_message_id.yaml
EmailSubject: fields/email_subject.yaml
EntityCreatedTime: fields/entity_created_time.yaml
EntityFeedType: fields/entity_feed_type.yaml
EntityId: fields/entity_id.yaml
EntityIngestionTime: fields/entity_ingestion_time.yaml
EntityIsDeleted: fields/entity_is_deleted.yaml
EntityLastAccessedTime: fields/entity_last_accessed_time.yaml
EntityLastModifiedTime: fields/entity_last_modified_time.yaml
EntityName: fields/entity_name.yaml
EntityNameType: fields/entity_name_type.yaml
EntityOriginalId: fields/entity_original_id.yaml
EntityOriginalSource: fields/entity_original_source.yaml
EntityProduct: fields/entity_product.yaml
EntitySchema: fields/entity_schema.yaml
EntitySchemaVersion: fields/entity_schema_version.yaml
EntitySource: fields/entity_source.yaml
EntitySubProduct: fields/entity_sub_product.yaml
EntityUpdatedTime: fields/entity_updated_time.yaml
EntityVendor: fields/entity_vendor.yaml
EventCount: fields/event_count.yaml
EventEndTime: fields/event_end_time.yaml
EventErrorDetails: fields/event_error_details.yaml
EventFinishReasons: fields/event_finish_reasons.yaml
EventMessage: fields/event_message.yaml
EventOriginalErrorType: fields/event_original_error_type.yaml
EventOriginalRequestDetails: fields/event_original_request_details.yaml
EventOriginalResultDetails: fields/event_original_result_details.yaml
EventOriginalSeverity: fields/event_original_severity.yaml
EventOriginalSubType: fields/event_original_sub_type.yaml
EventOriginalType: fields/event_original_type.yaml
EventOriginalUid: fields/event_original_uid.yaml
EventOutputType: fields/event_output_type.yaml
EventOwner: fields/event_owner.yaml
EventProduct: fields/event_product.yaml
EventProductVersion: fields/event_product_version.yaml
EventReportUrl: fields/event_report_url.yaml
EventRequestFrequencyPenalty: fields/event_request_frequency_penalty.yaml
EventRequestId: fields/event_request_id.yaml
EventRequestPresencePenalty: fields/event_request_presence_penalty.yaml
EventRequestSeed: fields/event_request_seed.yaml
EventRequestTemperature: fields/event_request_temperature.yaml
EventRequestTopP: fields/event_request_top_p.yaml
EventResponseId: fields/event_response_id.yaml
EventResult: fields/event_result.yaml
EventResultDetails: fields/event_result_details.yaml
EventSchema: fields/event_schema.yaml
EventSchemaVersion: fields/event_schema_version.yaml
EventSessionId: fields/event_session_id.yaml
EventSessionName: fields/event_session_name.yaml
EventSeverity: fields/event_severity.yaml
EventStartTime: fields/event_start_time.yaml
EventSubType: fields/event_sub_type.yaml
EventThoughtProcessDetails: fields/event_thought_process_details.yaml
EventThoughtProcessId: fields/event_thought_process_id.yaml
EventType: fields/event_type.yaml
EventUid: fields/event_uid.yaml
EventVendor: fields/event_vendor.yaml
ExternalUsersCount: fields/external_users_count.yaml
FileContentType: fields/file_content_type.yaml
FileExtension: fields/file_extension.yaml
FileIsSignatureValid: fields/file_is_signature_valid.yaml
FileMD5: fields/file_md5.yaml
FileName: fields/file_name.yaml
FilePath: fields/file_path.yaml
FileSHA1: fields/file_sha1.yaml
FileSHA256: fields/file_sha256.yaml
FileSHA512: fields/file_sha512.yaml
FileSignatureDetails: fields/file_signature_details.yaml
FileSize: fields/file_size.yaml
GroupId: fields/group_id.yaml
GroupIdType: fields/group_id_type.yaml
GroupName: fields/group_name.yaml
GroupNameType: fields/group_name_type.yaml
GroupOriginalType: fields/group_original_type.yaml
GroupType: fields/group_type.yaml
Hash: fields/hash.yaml
HashType: fields/hash_type.yaml
Hostname: fields/hostname.yaml
HttpContentFormat: fields/http_content_format.yaml
HttpContentType: fields/http_content_type.yaml
HttpCookie: fields/http_cookie.yaml
HttpHost: fields/http_host.yaml
HttpIsProxied: fields/http_is_proxied.yaml
HttpReferrer: fields/http_referrer.yaml
HttpRequestBodyBytes: fields/http_request_body_bytes.yaml
HttpRequestCacheControl: fields/http_request_cache_control.yaml
HttpRequestHeaderCount: fields/http_request_header_count.yaml
HttpRequestMethod: fields/http_request_method.yaml
HttpRequestTime: fields/http_request_time.yaml
HttpRequestXff: fields/http_request_xff.yaml
HttpResponseBodyBytes: fields/http_response_body_bytes.yaml
HttpResponseCacheControl: fields/http_response_cache_control.yaml
HttpResponseExpires: fields/http_response_expires.yaml
HttpResponseHeaderCount: fields/http_response_header_count.yaml
HttpResponseTime: fields/http_response_time.yaml
HttpStatusCode: fields/http_status_code.yaml
HttpUserAgent: fields/http_user_agent.yaml
HttpVersion: fields/http_version.yaml
IdentityDirectoryId: fields/identity_directory_id.yaml
IdentityDirectoryName: fields/identity_directory_name.yaml
IndicatorAssociation: fields/indicator_association.yaml
IndicatorType: fields/indicator_type.yaml
InnerVlanId: fields/inner_vlan_id.yaml
InputTokensUsed: fields/input_tokens_used.yaml
InternalUsersCount: fields/internal_users_count.yaml
IpAddr: fields/ip_addr.yaml
LogonMethod: fields/logon_method.yaml
LogonProtocol: fields/logon_protocol.yaml
LogonTarget: fields/logon_target.yaml
ModelName: fields/model_name.yaml
ModelProviderName: fields/model_provider_name.yaml
NetworkApplicationProtocol: fields/network_application_protocol.yaml
NetworkBytes: fields/network_bytes.yaml
NetworkConnectionHistory: fields/network_connection_history.yaml
NetworkDirection: fields/network_direction.yaml
NetworkDuration: fields/network_duration.yaml
NetworkIcmpCode: fields/network_icmp_code.yaml
NetworkIcmpType: fields/network_icmp_type.yaml
NetworkPackets: fields/network_packets.yaml
NetworkProtocol: fields/network_protocol.yaml
NetworkProtocolVersion: fields/network_protocol_version.yaml
NetworkRuleName: fields/network_rule_name.yaml
NetworkRuleNumber: fields/network_rule_number.yaml
NetworkSessionId: fields/network_session_id.yaml
NewPropertyValue: fields/new_property_value.yaml
NewValue: fields/new_value.yaml
Object: fields/object.yaml
ObjectId: fields/object_id.yaml
ObjectType: fields/object_type.yaml
OldValue: fields/old_value.yaml
Operation: fields/operation.yaml
OriginalObjectType: fields/original_object_type.yaml
OriginalUserType: fields/original_user_type.yaml
OuterVlanId: fields/outer_vlan_id.yaml
OutputTokensUsed: fields/output_tokens_used.yaml
ParentProcessCreationTime: fields/parent_process_creation_time.yaml
ParentProcessFileCompany: fields/parent_process_file_company.yaml
ParentProcessFileDescription: fields/parent_process_file_description.yaml
ParentProcessFileProduct: fields/parent_process_file_product.yaml
ParentProcessFileVersion: fields/parent_process_file_version.yaml
ParentProcessGuid: fields/parent_process_guid.yaml
ParentProcessId: fields/parent_process_id.yaml
ParentProcessIMPHASH: fields/parent_process_imphash.yaml
ParentProcessInjectedAddress: fields/parent_process_injected_address.yaml
ParentProcessIntegrityLevel: fields/parent_process_integrity_level.yaml
ParentProcessIsHidden: fields/parent_process_is_hidden.yaml
ParentProcessMD5: fields/parent_process_md5.yaml
ParentProcessName: fields/parent_process_name.yaml
ParentProcessSHA1: fields/parent_process_sha1.yaml
ParentProcessSHA256: fields/parent_process_sha256.yaml
ParentProcessSHA512: fields/parent_process_sha512.yaml
ParentProcessTokenElevation: fields/parent_process_token_elevation.yaml
PlatformTargetAgentDescription: fields/platform_target_agent_description.yaml
PlatformTargetAgentId: fields/platform_target_agent_id.yaml
PlatformTargetAgentName: fields/platform_target_agent_name.yaml
PlatformTargetOriginalAgentType: fields/platform_target_original_agent_type.yaml
PreviousPropertyValue: fields/previous_property_value.yaml
Process: fields/process.yaml
ProcessCommandLine: fields/process_command_line.yaml
ProcessFileCompany: fields/process_file_company.yaml
ProcessId: fields/process_id.yaml
ProcessName: fields/process_name.yaml
RegistryKey: fields/registry_key.yaml
RegistryPreviousKey: fields/registry_previous_key.yaml
RegistryPreviousValue: fields/registry_previous_value.yaml
RegistryPreviousValueData: fields/registry_previous_value_data.yaml
RegistryPreviousValueType: fields/registry_previous_value_type.yaml
RegistryValue: fields/registry_value.yaml
RegistryValueData: fields/registry_value_data.yaml
RegistryValueType: fields/registry_value_type.yaml
RequestedIpAddr: fields/requested_ip_addr.yaml
Rule: fields/rule.yaml
RuleDescription: fields/rule_description.yaml
RuleName: fields/rule_name.yaml
RuleNumber: fields/rule_number.yaml
SessionId: fields/session_id.yaml
SitePath: fields/site_path.yaml
SitePrimaryUri: fields/site_primary_uri.yaml
Src: fields/src.yaml
SrcAgentBlueprintId: fields/src_agent_blueprint_id.yaml
SrcAgentDescription: fields/src_agent_description.yaml
SrcAgentId: fields/src_agent_id.yaml
SrcAgentName: fields/src_agent_name.yaml
SrcAgentOriginalType: fields/src_agent_original_type.yaml
SrcAppId: fields/src_app_id.yaml
SrcAppName: fields/src_app_name.yaml
SrcAppType: fields/src_app_type.yaml
SrcBytes: fields/src_bytes.yaml
SrcDescription: fields/src_description.yaml
SrcDeviceType: fields/src_device_type.yaml
SrcDomain: fields/src_domain.yaml
SrcDomainType: fields/src_domain_type.yaml
SrcDvcId: fields/src_dvc_id.yaml
SrcDvcIdType: fields/src_dvc_id_type.yaml
SrcDvcOs: fields/src_dvc_os.yaml
SrcDvcScope: fields/src_dvc_scope.yaml
SrcDvcScopeId: fields/src_dvc_scope_id.yaml
SrcFileCreationTime: fields/src_file_creation_time.yaml
SrcFileDirectory: fields/src_file_directory.yaml
SrcFileExtension: fields/src_file_extension.yaml
SrcFileMD5: fields/src_file_md5.yaml
SrcFileMimeType: fields/src_file_mime_type.yaml
SrcFileName: fields/src_file_name.yaml
SrcFilePath: fields/src_file_path.yaml
SrcFilePathType: fields/src_file_path_type.yaml
SrcFileSHA1: fields/src_file_sha1.yaml
SrcFileSHA256: fields/src_file_sha256.yaml
SrcFileSHA512: fields/src_file_sha512.yaml
SrcFileSize: fields/src_file_size.yaml
SrcFQDN: fields/src_fqdn.yaml
SrcGeoCity: fields/src_geo_city.yaml
SrcGeoCountry: fields/src_geo_country.yaml
SrcGeoLatitude: fields/src_geo_latitude.yaml
SrcGeoLongitude: fields/src_geo_longitude.yaml
SrcGeoRegion: fields/src_geo_region.yaml
SrcHostname: fields/src_hostname.yaml
SrcInterfaceGuid: fields/src_interface_guid.yaml
SrcInterfaceName: fields/src_interface_name.yaml
SrcIpAddr: fields/src_ip_addr.yaml
SrcIsp: fields/src_isp.yaml
SrcMacAddr: fields/src_mac_addr.yaml
SrcNatIpAddr: fields/src_nat_ip_addr.yaml
SrcNatPortNumber: fields/src_nat_port_number.yaml
SrcOriginalRiskLevel: fields/src_original_risk_level.yaml
SrcOriginalUserType: fields/src_original_user_type.yaml
SrcPackets: fields/src_packets.yaml
SrcPortNumber: fields/src_port_number.yaml
SrcProcessGuid: fields/src_process_guid.yaml
SrcProcessId: fields/src_process_id.yaml
SrcProcessName: fields/src_process_name.yaml
SrcRiskLevel: fields/src_risk_level.yaml
SrcUserId: fields/src_user_id.yaml
SrcUserIdType: fields/src_user_id_type.yaml
SrcUsername: fields/src_username.yaml
SrcUsernameType: fields/src_username_type.yaml
SrcUserScope: fields/src_user_scope.yaml
SrcUserScopeId: fields/src_user_scope_id.yaml
SrcUserSessionId: fields/src_user_session_id.yaml
SrcUserType: fields/src_user_type.yaml
SrcVlanId: fields/src_vlan_id.yaml
SrcZone: fields/src_zone.yaml
TargetAgentBlueprintId: fields/target_agent_blueprint_id.yaml
TargetAgentDescription: fields/target_agent_description.yaml
TargetAgentId: fields/target_agent_id.yaml
TargetAgentName: fields/target_agent_name.yaml
TargetAgentOriginalType: fields/target_agent_original_type.yaml
TargetAgentUserId: fields/target_agent_user_id.yaml
TargetAgentUsername: fields/target_agent_username.yaml
TargetAppId: fields/target_app_id.yaml
TargetAppName: fields/target_app_name.yaml
TargetAppType: fields/target_app_type.yaml
TargetDescription: fields/target_description.yaml
TargetDeviceType: fields/target_device_type.yaml
TargetDomain: fields/target_domain.yaml
TargetDomainType: fields/target_domain_type.yaml
TargetDvcId: fields/target_dvc_id.yaml
TargetDvcIdType: fields/target_dvc_id_type.yaml
TargetDvcOs: fields/target_dvc_os.yaml
TargetDvcScope: fields/target_dvc_scope.yaml
TargetDvcScopeId: fields/target_dvc_scope_id.yaml
TargetFileCreationTime: fields/target_file_creation_time.yaml
TargetFileDirectory: fields/target_file_directory.yaml
TargetFileExtension: fields/target_file_extension.yaml
TargetFileMD5: fields/target_file_md5.yaml
TargetFileMimeType: fields/target_file_mime_type.yaml
TargetFileName: fields/target_file_name.yaml
TargetFilePath: fields/target_file_path.yaml
TargetFilePathType: fields/target_file_path_type.yaml
TargetFileSHA1: fields/target_file_sha1.yaml
TargetFileSHA256: fields/target_file_sha256.yaml
TargetFileSHA512: fields/target_file_sha512.yaml
TargetFileSize: fields/target_file_size.yaml
TargetFQDN: fields/target_fqdn.yaml
TargetGeoCity: fields/target_geo_city.yaml
TargetGeoCountry: fields/target_geo_country.yaml
TargetGeoLatitude: fields/target_geo_latitude.yaml
TargetGeoLongitude: fields/target_geo_longitude.yaml
TargetGeoRegion: fields/target_geo_region.yaml
TargetHostname: fields/target_hostname.yaml
TargetIpAddr: fields/target_ip_addr.yaml
TargetOriginalAppType: fields/target_original_app_type.yaml
TargetOriginalRiskLevel: fields/target_original_risk_level.yaml
TargetOriginalUserType: fields/target_original_user_type.yaml
TargetPortNumber: fields/target_port_number.yaml
TargetProcessCommandLine: fields/target_process_command_line.yaml
TargetProcessCreationTime: fields/target_process_creation_time.yaml
TargetProcessCurrentDirectory: fields/target_process_current_directory.yaml
TargetProcessFileCompany: fields/target_process_file_company.yaml
TargetProcessFileDescription: fields/target_process_file_description.yaml
TargetProcessFileInternalName: fields/target_process_file_internal_name.yaml
TargetProcessFilename: fields/target_process_filename.yaml
TargetProcessFileOriginalName: fields/target_process_file_original_name.yaml
TargetProcessFileProduct: fields/target_process_file_product.yaml
TargetProcessFileSize: fields/target_process_file_size.yaml
TargetProcessFileVersion: fields/target_process_file_version.yaml
TargetProcessGuid: fields/target_process_guid.yaml
TargetProcessId: fields/target_process_id.yaml
TargetProcessIMPHASH: fields/target_process_imphash.yaml
TargetProcessInjectedAddress: fields/target_process_injected_address.yaml
TargetProcessIntegrityLevel: fields/target_process_integrity_level.yaml
TargetProcessIsHidden: fields/target_process_is_hidden.yaml
TargetProcessMD5: fields/target_process_md5.yaml
TargetProcessName: fields/target_process_name.yaml
TargetProcessSHA1: fields/target_process_sha1.yaml
TargetProcessSHA256: fields/target_process_sha256.yaml
TargetProcessSHA512: fields/target_process_sha512.yaml
TargetProcessStatusCode: fields/target_process_status_code.yaml
TargetProcessTokenElevation: fields/target_process_token_elevation.yaml
TargetRiskLevel: fields/target_risk_level.yaml
TargetSessionId: fields/target_session_id.yaml
TargetUrl: fields/target_url.yaml
TargetUserId: fields/target_user_id.yaml
TargetUserIdType: fields/target_user_id_type.yaml
TargetUsername: fields/target_username.yaml
TargetUsernameType: fields/target_username_type.yaml
TargetUserScope: fields/target_user_scope.yaml
TargetUserScopeId: fields/target_user_scope_id.yaml
TargetUserSessionGuid: fields/target_user_session_guid.yaml
TargetUserSessionId: fields/target_user_session_id.yaml
TargetUserType: fields/target_user_type.yaml
TcpFlagsAck: fields/tcp_flags_ack.yaml
TcpFlagsCwr: fields/tcp_flags_cwr.yaml
TcpFlagsEce: fields/tcp_flags_ece.yaml
TcpFlagsFin: fields/tcp_flags_fin.yaml
TcpFlagsNs: fields/tcp_flags_ns.yaml
TcpFlagsPsh: fields/tcp_flags_psh.yaml
TcpFlagsRst: fields/tcp_flags_rst.yaml
TcpFlagsSyn: fields/tcp_flags_syn.yaml
TcpFlagsUrg: fields/tcp_flags_urg.yaml
ThreatCategory: fields/threat_category.yaml
ThreatConfidence: fields/threat_confidence.yaml
ThreatField: fields/threat_field.yaml
ThreatFilePath: fields/threat_file_path.yaml
ThreatFirstReportedTime: fields/threat_first_reported_time.yaml
ThreatId: fields/threat_id.yaml
ThreatIpAddr: fields/threat_ip_addr.yaml
ThreatIsActive: fields/threat_is_active.yaml
ThreatLastReportedTime: fields/threat_last_reported_time.yaml
ThreatName: fields/threat_name.yaml
ThreatOriginalCategory: fields/threat_original_category.yaml
ThreatOriginalConfidence: fields/threat_original_confidence.yaml
ThreatOriginalRiskLevel: fields/threat_original_risk_level.yaml
ThreatRiskLevel: fields/threat_risk_level.yaml
ToolDescription: fields/tool_description.yaml
ToolId: fields/tool_id.yaml
ToolName: fields/tool_name.yaml
ToolOriginalType: fields/tool_original_type.yaml
TransactionIdHex: fields/transaction_id_hex.yaml
UpdatedPropertyName: fields/updated_property_name.yaml
Url: fields/url.yaml
UrlCategory: fields/url_category.yaml
UrlOriginal: fields/url_original.yaml
User: fields/user.yaml
UserAgent: fields/user_agent.yaml
UserId: fields/user_id.yaml
UserIdType: fields/user_id_type.yaml
Username: fields/username.yaml
UsernameType: fields/username_type.yaml
UserScope: fields/user_scope.yaml
UserScopeId: fields/user_scope_id.yaml
UserSessionId: fields/user_session_id.yaml
UserType: fields/user_type.yaml
Value: fields/value.yaml
ValueType: fields/value_type.yaml
